{
	"movies": [
		{
			"name" : "Ant-Man and the Wasp",
			"year" : "2018",
			"overview" : "Just when his time under house arrest is about to end, Scott Lang puts again his freedom at risk to help Hope van Dyne and Dr. Hank Pym dive into the quantum realm and try to accomplish, against time and any chance of success.",
			"img" : "antman.jpg",
			"genre" : ["Action","Adventure","Science Fiction"],
			"likes" : 19,
			"runtime" : 118,
			"plot" : "As Scott Lang balances being both a Super Hero and a father, Hope van Dyne and Dr. Hank Pym present an urgent new mission that finds the Ant-Man fighting alongside The Wasp to uncover secrets from their past.",
			"storyline" : "In the aftermath of The First Avenger: Civil War (2016), Scott Lang grapples with the consequences of his choices as both a superhero and a father. As he struggles to rebalance his home life with his responsibilities as Ant-Man, he's confronted by Hope van Dyne and Dr. Hank Pym with an urgent new mission. Scott must once again put on the suit and learn to fight alongside The Wasp as the team works together to uncover secrets from their past. Written by Walt Disney Studios",
			"director" : "Peyton Reed",
			"writers" : ["Chris McKenna", "Erik Sommers"],
			"stars" : ["Paul Rudd", "Evangeline Lilly", "Michael Peña"],
			"sites" : [["Marvel [United States]","https://www.marvel.com/movies/ant-man-and-the-wasp"],["Official Site", "https://www.marvel.com/antman"]],
			"country" : "USA",
			"language" : "English",
			"releaseDate" : "26 July 2018 (Germany)",
			"aka" : "Ant-Man and the Wasp",
			"locations" : ["Atlanta", "Georgia", "USA"],
			"budget" : ["$162,000,000 (estimated)", "$75,812,205, 8 July 2018, Wide Release", "$216,370,952, 7 October 2018", "$465,879,576, 19 August 2018"],
			"synopsis" : ["The film opens in 1987 as Hank Pym (Michael Douglas) and his wife Janet Van Dyne (Michelle Pfeiffer) are set to go on a mission, leaving their young daughter Hope (Madeleine McGraw) in the care of their housekeeper. As Ant-Man and the Wasp, they shrink themselves to stop a Soviet nuclear missile from hitting American soil. Janet went subatomic to drop the missile into the ocean, but it left her lost in the Quantum Realm, and she was presumed dead. However, after Scott Lang (Paul Rudd), as the new Ant-Man, went sub-atomic and managed to return to normal size, Hank tells Hope (now played by Evangeline Lilly) that there might be a way to bring Janet back.","In the present day, Scott has been under house arrest after violating the Sokovia Accords by working with Captain America in Stuttgart, Germany. He is spending his day with Cassie (Abby Ryder Fortson), who is visiting him for the day. Scott has a whole area set up with the help of Luis (Michael Pena) in his house for them to play in, including a slide that goes out the door. Unfortunately, Scott's foot breaks through the perimeter, and the FBI pays him a visit. Agent Jimmy Woo (Randall Park) leads the inspection to make sure Scott isn't doing anything suspicious. Scott explains that he's had to get creative to entertain Cassie, including doing sleight of hand magic, which impresses Woo. The FBI leaves, and Cassie goes home with Maggie (Judy Greer) and Paxton (Bobby Cannavale).", "With only three days left under house arrest, Scott does what he can to keep himself occupied. He takes a bath and then has a dream where he finds himself as Janet playing Hide and Seek with a young Hope. Scott later gives Hank a call, despite both him and Hope not having spoken to him since his arrest. He tells Hank about the dream he saw. Hours later, Scott is tranquilized by something flying in the room.", "Scott wakes up to find Hope driving him somewhere in a shrunken van. She lets him know that she took off his ankle bracelet and put it on a giant ant. They arrive at her and Hank's lab where they show Scott that they have created a tunnel to the Quantum Realm in the hopes of bringing Janet back. After Scott describes his dream in full detail, Hank and Hope deduce that he and Janet are connected because of the time he spent in the Quantum Realm. They are missing a key component to get the tunnel to work, so they head to meet with someone who possesses it. Hank shrinks the lab and takes it with him. They don't realize they are being watched by a transparent figure.", "The three arrive at a restaurant where Hope meets with Sonny Burch (Walton Goggins), a black market tech dealer, while Scott and Hank monitor the situation from outside in the van. He knows Hope as &quot;Susan&quot;, but he has already figured out her identity by the time she arrives. Burch refuses to give up the component that Hope needs, so she appears to leave. Burch and his goons start to walk out, but they are knocked around by Hope in her Wasp suit. Scott is impressed to see that she has wings and blasters. She fights them in the restaurant's kitchen and manages to grow a salt shaker to knock out one goon while also running across knives being thrown at her. As Hope grabs the component, she is attacked by the figure from earlier, Ghost (Hannah John-Kamen). She is able to phase through anything, which means Hope's punches go through her. Scott joins Hope as Ant-Man in a new suit to help her, but Ghost escapes and makes her way to the van and steals the lab from Hank", "Scott brings Hope and Hank to hide at X-Con, the security company run by Luis, with Dave (Tip &quot;T.I.&quot; Harris) and Kurt (David Dastmalchian) as his employees. There, they try to come up with a plan to get the lab back. Hank figures that he has to reluctantly seek help from a former friend and partner of his, Bill Foster (Laurence Fishburne).", "Ghost, whose real name is Ava, goes to her home. She phases involuntarily and must sleep inside a special chamber to control the phasing.", "Scott, Hope, and Hank go in disguise to the university that Bill teaches at. He maintains a grudge with Hank over the work they did together decades earlier, Project Goliath, in which Bill reached 21 feet. Scott then sees Woo and his fellow agents outside, thinking they know he's in there. Before they go, Bill tells them that they can locate the lab by modifying a defractor on one of the suit's regulators. Hank says they can't use the new Ant-Man suit because it's a work-in-progress, so Scott tells them they can find it in the older suit, which is in a trophy that Cassie took to school for show-and-tell.", "Scott and Hope sneak into Cassie's school, but the regulator on Scott's suit malfunctions, making him the size of a child. They get to Cassie's classroom and get the suit out of the trophy before they are spotted.", "The trio locate Ava's home and find the lab, but she knocks all three of them out and has them tied up. She reveals she is working with Bill, who took her in as a child. Her father, Elihas Starr (Michael Cerveris), had attempted an experiment to reach the Quantum Realm, but his own tunnel became unstable. His wife Catherine (Riann Steele) tried to escape with young Ava, but the little girl ran back for her father. The tunnel caused a huge explosion, killing Elihas and Catherine, but Ava survived and her molecules became destabilized, resulting in her phasing. She and Bill now plan to use Janet's quantum energy to help turn Ava normal, even if it might kill Janet. Hank fakes having a heart attack to get Bill to grab a tin of Altoids for his meds, which really contain Hank's trained ants that grow to a large size and help free them, allowing the three to escape and take the lab back.", "After regrowing the lab, Scott becomes connected to Janet, who proves herself to Hope and Hank as she helps stabilize the tunnel and enter the coordinates to locate her, but she warns them that they only have two hours before the Quantum Realm becomes so unstable they won't be able to reach her for another century.", "Burch and his goons go to X-Con and interrogate Luis, Dave, and Kurt using a truth serum (though the villains insist that's not what it is). Luis reveals that Scott is with Hope and Hank in the woods where they set up the lab. Ava appears after having heard this information, and she takes out the wheels on Burch's van as she heads to find the heroes herself. Burch then contacts the crooked FBI Agent Stoltz (Sean Kleier) and tells him where Scott will be. Stoltz tells Woo, and Luis quickly warns Scott so that he can return home before he is caught escaping his house arrest. Cassie is with him and says he could use a partner to help him, meaning herself, but Scott says he has Hope, which Cassie thinks is also a good fit.", "Hope and Hank are caught by FBI agents once they shrink the lab. Stoltz grabs it but he is knocked out by Ava, who then takes the lab herself. Scott uses the trained ants to help Hope and Hank break out of the FBI headquarters. The ants guide the three to the lab's location, and Luis joins them as backup. Hank uses the giant ants to get Bill out so that he can use his old suit to go into the Quantum Realm and find Janet. The lab is shrunken again, and Luis grabs it. Scott, as Ant-Man, is attacked by Ava, but he holds her off long enough for Hope and Luis to get away.", "Scott flies away on a flying ant to meet up with Hope and Luis at the rendezvous point, but they are followed by Burch and his men, as well as Ava. Hope shrinks and grows the van to literally throw the goons off, even growing a Hello Kitty Pez dispenser to throw at one of them. Scott grows to Giant Man to stop them, but as Ava intervenes, Hope becomes The Wasp to fight her. Burch takes the lab and runs to the docks where he boards a ship to get away. Scott grows again to reach him and stop him to recover the lab. Luis shows up in another car to meet with them, but Scott gets light-headed from being so huge that he falls into the water. Hope swims down to save him.", "In the Quantum Realm, Hank nearly loses his signal, but he finally manages to locate Janet at her coordinates, and they reunite with a kiss. Meanwhile, the lab has grown to its normal size, and Ava and Bill are planning to get Janet's quantum energy. Hank and Janet start to return as Ava and Bill begin the process, which starts to drain Janet. Scott and Hope show up and disable their machine, giving Hank and Janet enough time to come out of the Quantum Realm. Hope reunites with her mother at last. Janet then sees Ava's problem, and she puts her hands on Ava to stabilize her and stop her phasing. Everyone leaves as the heroes take the lab. Bill wants to keep protecting Ava, but she tells him they need to split up. Outside the lab, Dave and Kurt help Luis incapacitate Burch and his goons before injecting them with truth serum as the cops arrive, leading to their arrest.", "Woo thinks he knows Scott is out on the streets as Ant-Man, but he goes to his home and finds Scott there. Scott's sentence is finally over, and he is a free man once more. The first thing he does is go see Cassie.", "In the final scene, Luis gets a new client for his business to keep them from going under. Hank brings Janet to the beach where they set up a new house that he grows. Scott shrinks himself, Hope, and Cassie in a car so they can use a laptop as a screen like a drive-in movie. They are then bothered by a large butterfly.", "Mid-Credits: Hank and Janet have set up the Quantum Tunnel in a van on a rooftop with Hope's help so that Scott can enter it. He obtains quantum energy to keep helping Ava be stabilized. Just as Scott is ready to go back, the others fail to bring him back, and he doesn't hear anyone on the other end of the radio. Back in the real world, Hank, Janet, and Hope have all been turned to ash by Thanos snapping his fingers (at the end of 'Avengers: Infinity War'), leaving Scott forever trapped in the Quantum Realm with no chance of getting back to Earth.", "Post-Credits: Most of San Francisco appears to have felt the effects of the Gauntlet; more than half of all life in the city and on Earth and the entire universe is gone... except for the giant ant, who is still in Scott's apartment playing on his drum-set.", "The final text reads &quot;Ant-Man and the Wasp will return...?&quot;"],
			"trailer" : "https://www.imdb.com/videoembed/vi1264498713"
		},
		{
			"name" : "Incredibles 2",
			"year" : "2018",
			"overview" : "Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children.",
			"img" : "incredibles2.jpg",
			"genre" : ["Action","Animation","Adventure","Family","Comedy","Science Fiction"],
			"likes" : 31,
			"runtime" : 118,
			"plot" : "Bob Parr (Mr. Incredible) is left to care for the kids while Helen (Elastigirl) is out saving the world.",
			"storyline" : "While the Parr family has accepted its collective calling as superheroes, the fact remains that their special heroism is still illegal. After they are arrested after unsuccessfully trying to stop the Underminer, their future seems bleak. However, the wealthy Deavor siblings of Devtech offer new hope with a bold project to rehabilitate the public image and legal status of Supers, with Elastigirl being assigned on point to be the shining example. Now having agreed for now to stay at home to care of the kids, Mr. Incredible finds domestic life a daunting challenge, especially with baby Jack-Jack's newly emerged powers making him almost impossible to manage. However, Elastigirl soon has her own concerns dealing with the menace of a new supervillain, Screenslaver, who is wreaking havoc with his mind control abilities. Now, Elastigirl must solve the mystery of this enemy, who has malevolent designs on the world with the Parr family and friends key targets of this evil. Written by Kenneth Chisholm (kchishol@rogers.com)",
			"director" : " Brad Bird",
			"writers" : ["Brad Bird"],
			"stars" : ["Craig T. Nelson", "Holly Hunter", "Sarah Vowell"],
			"sites" : [["Official Site","https://movies.disney.com/incredibles-2"]],
			"country" : "USA",
			"language" : "English",
			"releaseDate" : "27 September 2018 (Germany)",
			"aka" : "Die Unglaublichen 2, ",
			"locations" : ["Pixar Animation Studios - 1200 Park Avenue","Emeryville", "California", "USA" ],
			"budget" : ["$200,000,000 (estimated)", "$182,687,905, 17 June 2018, Wide Release", "$607,180,485, 8 October 2018", "$1,121,290,260, 19 August 2018"],
			"synopsis" : ["Agent Rick Dicker (Jonathan Banks) is interviewing a boy named Tony Rydinger. Tony tells him how he met up with a classmate named Violet Parr (Sarah Vowell) at a track meet, and they agreed to go on a date together. Later, in the parking lot, a supervillain who called himself the Underminer (John Ratzenberger) burrowed up through the ground and said he was declaring war on peace and happiness. Everyone else scattered, but Tony found himself with no easy escape route, so he ducked behind a car and watched what unfolded. He saw a family of superheroes in matching suits, and the mother told one of the kids to patrol the perimeter and keep people away, and the other one to watch the baby, Jack-Jack. As the parents went after the Underminer, Tony saw an opportunity to escape, but then he recognized the voice of the girl. The boy ran off with super speed to do perimeter duty, leaving her alone with the baby. Frustrated, she ripped off her mask and threw it on the ground. Then Tony saw that she was Violet. Seeing him looking at her, she walked up to him and tried to explain, but he just ran away. He tells Rick that he feels bad about what he did, and he wishes he could just forget ever seeing Violet in her super suit.", "The Underminer bored back into the ground, setting off an underground explosion that caused bank buildings to collapse into the ground. Drilling through the vaults, he used a tube with vacuum suction to grab cash from the vaults. Mr. Incredible (Craig T. Nelson) confronts him, and the Underminer turns toward him, sucking him into the tube. He landed in the tunneler's storage vault and banged his way out with super strength. The Underminer puts the borer on autopilot, and the two of them fought. Mr. Incredible pushed the Underminer into the borer's control panel, smashing it. The Underminer jumped into the vault and escaped, leaving Mr. Incredible to deal with the now out-of-control drill. It burst through the surface into the street. Dash (Huck Milner) saw a dust cloud in the distance and ran toward it, with Violet pushing Jack-Jack in his stroller and running after Dash. Elastigirl (Holly Hunter) stretched herself from one building to another, catching up to the careening drill. It slammed into a support column, destroying the monorail track right as a vehicle approached. Suddenly, their friend Frozone (Samuel L. Jackson) glided in and made a track that guided the monorail safely to the ground. The borer was still running down the street, scraping the sides of buildings along the way. The drill hit a car and flung it into the air, and Dash ran up to an old woman and pulled her out of the way just before the car crashed down. Violet caught up to him and handed off Jack-Jack in the stroller. Elastigirl stretched herself out across an overpass, stopping cars from getting on a bridge as the drill destroyed the supports. Mr. Incredible grabbed a fallen streetlamp and threw it into the treads, but it soon snapped. Dash ran up to him and put Jack-Jack in his hands. Violet threw up force fields to protect bystanders from the machine. Mr. Incredible ran past her and handed Jack-Jack back to her. Elastigirl jumped into the open hatch of the borer, with the rest of the family chasing after it. They saw that it was heading straight for City Hall. Elastigirl stretched out through the engine, trying to spill the coolant so it would overheat. Mr. Incredible jumped in and helped her, and they stopped the drill just short of City Hall. Violet and Dash jumped in, and she put a force field around the whole family just before the engine blew. Looking out the hatch, they saw themselves surrounded by cops with their guns drawn.", "Rick Dicker gives the family a ride, and Violet tells them that Tony had seen her without her mask. Rick brings them to the hotel room where they've been staying since their house had been destroyed. Rick tells them that the Super Relocation Program has been shut down, and he can only let them stay in the hotel for two more weeks, after which they'll be on their own. They say goodbye to him, and sit down at the table to eat Chinese takeout. Violet asks them if they're going to talk about the day's events. Helen tells them that things are different now, with supers being forbidden to do hero work. Violet asks if that means they're going to go back to never using their powers. After going back and forth, Helen slams her hand down on the table, ending the conversation. Later that night, after the kids fell asleep, Bob and Helen are sitting at the hotel pool, wondering what they're going to do. Helen tells him that one of them will have to get a regular job. Suddenly, Lucius shows up, and he offers to let the family move in with himself and his wife, Honey (Kimberly Adair Clark) after their time in the hotel is up. Then he tells them that during the Underminer attack, a man who represents the business tycoon Winston Deavor (Bob Odenkirk) handed him a business card, and said that Winston wanted to talk to Lucius, Bob and Helen. With no other options, they agree to the meeting.", "The three of them show up outside a huge building, the headquarters of DevTech. They get security badges and take the elevator to the top floor, and are greeted by Winston. A woman also walks up and Winston introduces her as his sister, Evelyn (Catherine Keener). He tells them he saw what they did with their kids earlier, and they shoot each other a look, realizing he knows their secret identities. He says he used to work for Rick years ago, before the Supers were forced into hiding, and he explains that Rick was a huge fan of them. Rick had a direct phone line installed in the Deavor house, so they could call the Supers any time they needed them. Winston tells them that one night thieves broke into their house, and his father tried to call Gazerbeam and Fironic, but since Supers had been outlawed, neither one of them answered. The thieves found his dad and shot him. A few months later, Winston's mom died from heartbreak. He says that if the Supers hadn't been in hiding, it never would have happened. Evelyn counters that her dad should've hidden himself at the first sign of trouble, and Winston explains that they've had that argument forever. Since then, Winston and Evelyn built DevTech, a telecommunications company, with the goal of righting some wrongs. Winston and Evelyn explain that the Supers have been in hiding because of the people's perception. All they see is the destruction the Supers cause, not the hard decisions they make or the lives they save. To change that, Evelyn shows them that there are cameras in their badges, and says their new super suits will have cameras as well. Winston says they just need to be super, and he'll make sure they'll all be legal again some day. Enthusiastically, Bob asks what their first assignment will be, but Winston says that Elastigirl should be the first Super that the public sees in action. Bob reluctantly agrees, but Helen is still unsure.", "Back at the hotel, Bob asks Helen why she wouldn't want to take the opportunity, and she explains that the children will need her. Dash is struggling with math, and Violet is nervous about her upcoming date with Tony. Jack-Jack, being a baby, will naturally need lots of attention, whether he has powers or not. Neither of them knew that he had used his powers once before, to escape from being kidnapped by Syndrome, since at the time they were on the ground and he was high in the air, beyond their sight. Bob tells her that the choice is to change the world to allow their children to be who they are, or to possibly soon be homeless. She asks if he'll be okay watching the kids, and he says he can handle it with no problem. Lying down to sleep, they knew tomorrow they'd tell Winston that Elastigirl was in.", "Winston sends a limo to pick up the family and take them to a huge house that he owns, and he says they can stay as long as they need. Later, Elastigirl comes out of the bathroom wearing her new super suit, one that was designed by Alexander Galbaki. Bob teases her that when Edna Mode (Brad Bird) finds out, she won't be happy. Helen finds a note from Evelyn saying there's something in the garage for her. She goes out and finds a motorcycle that can split into two parts. Bob watches as she takes off down the street. The next morning, Bob fixes breakfast for the kids, and Violet asks him if Helen is breaking the law by doing hero work. Bob is relieved to see the school bus pull up, and sends the kids off.", "That night, Violet gets ready for her date with Tony. Bob reads Jack-Jack a bedtime story, and the baby falls asleep. Bob then tries to help Dash with his math homework, but Dash tells him they want the problems done a certain way, and then says he'll just wait until Helen comes home. The TV turns on, and Bob is surprised to see Jack-Jack sitting on the couch. He takes him back up to his room and reads another story.", "In the city, Elastigirl is in attendance at the unveiling ceremony of a new hovertrain. The mayor gives a speech as the Deavors watch in a studio through Helen's bodycam. The mayor cut the ribbon, and the train got its first group of passengers. It lifts up and suddenly takes off in the wrong direction. Elastigirl jumps on her cycle and takes off after it. Riding through tunnels and on rooftops, she is able to land on top of the train. Before she can plan her next move, the train goes into a tunnel. She ditches the bike and flattens herself on the roof. She reaches the engineer and finds him staring straight ahead. Coming out of the tunnel, Elastigirl makes herself into a parachute and slows the train to a stop. Going back to the engineer, she notices a pulsing light in his cabin. A message appears on a monitor saying &quot;Welcome back, Elastigirl--The Screenslaver&quot;", "Bob keeps trying to get Jack-Jack to stay in his bed, with no luck. Going downstairs, he finds Violet, who never left for her date, and she tells him not to say anything. Bob goes back to the living room and sits Jack-Jack down next to him and falls asleep. On the TV, a movie is playing with a masked robber holding a man at gunpoint. Jack-Jack sees the masked man, and then looks out the window and sees a raccoon rummaging through the trash. He walks up to the window and is able to pass through it with his powers. Grabbing a half-eaten chicken leg away from the raccoon, he throws it back in the garbage can and uses another power to lift the lid with his mind and slam it down on the can. Then laser beams come out of his eyes, just missing the raccoon. Bob wakes up from the commotion and goes outside to grab Jack-Jack. Just then, the baby split into six separate copies of himself. Bob realizes that Jack-Jack has multiple superpowers. Taking Jack-Jack back inside, Bob gets a call from Helen. She asks him how things are going, and he lies and says the kids are just fine. She tells him about saving the runaway train, and he turns on the TV to see news reports about the dramatic rescue. She thanks him for taking care of the kids, and they hang up. Bob puts Dash and Jack-Jack to bed, and then cracks open Dash's math book. Later, he wakes up Dash and tells him that he understands the math problems and can help Dash before school starts.", "Elastigirl is getting ready to be interviewed by a news anchor named Chad Brentley. Chad is interviewing a foreign ambassador as Helen sits in a green room, nervously waiting for her turn. A stage hand comes in and walks her toward the stage. The ambassador sees Helen and greets her enthusiastically. Chad introduces Elastigirl to the audience, and she walks out to the stage. Suddenly, Chad's eyes glaze over and he starts talking in a robotic monotone. Following his eyes, Helen notices a blinking light on a screen. She looks away just in time to avoid being hypnotized herself. Chad says that everyone is being controlled by screens. Helen makes her way to the control room, where she finds everyone staring ahead blankly. The robotic voice continues, saying that the screens are being controlled by the Screenslaver. The voice says the Screenslaver will hijack the ambassador's aerocade, and Helen runs and smashes a window. Stretching herself out of the building, she climbs on a rooftop and sees three helicopters airborne. Launching herself like a slingshot, she crashes through one of the helicopters' windows, but the ambassador isn't there. She tells the pilot to get her close to another copter, and she makes the jump. Finding the ambassador in the back, she breaks open the door to the cockpit and sees the pilots in a trance. She smashes the screen with the blinking light to bring them back. Just then, the third chopper smashes into them. Struggling to gain control, she asks the pilots if they can swim, then pushes them out so they land in the river below. Then she grabs the ambassador and slings herself into the air, making a parachute to bring the ambassador safely to the ground.", "The next morning, Bob is getting the kids ready for school. Violet looks awful and tells him that yesterday at school, she asked Tony why he stood her up, and he acted like he didn't know her at all. Bob tells her that Rick has had to erase many people's memories after they found out his or Helen's secret identity. Violet realizes that Rick had erased Tony's memory, after Bob told him to. Stomping off, she grabs her super suit and stuffs it in the garbage disposal and turns it on. But since the suit is indestructible, nothing happens to it. Angrily, she grabs it and throws it against the wall, vowing never to be a hero again.", "Helen is in a limousine, being given a ride back to the DevTech building. There, a group of people cheer for her, making her feel proud, but she knows the Screenslaver is still out there. Inside, Winston hands her a newspaper that has a headline about the ambassador giving a pro-Super speech, and he tells her their plan is working. She tries to be enthusiastic, but she's still worried about the Screenslaver. He leads her into a room filled with other superheroes in costume. One of the women introduces herself as Voyd (Sophia Bush), and demonstrates her power to make portals that can instantly transport people or things anywhere. Other supers come up and introduce themselves as Screech, Brick, Reflux and He-lectric. They all chatted a while, and Helen is proud of the positive effect she's had on them. Talking with Evelyn, Helen hits upon a plan to lure the Screenslaver out. Evelyn will make a tracking device, and while Chad interviews Helen remotely, they'll track the signal.", "Bob calls Rick and asks him if he remembers wiping Tony's memory, then explains that he went too far, erasing all memory of Violet from his mind. Rick replies that memory wiping isn't an exact science. Bob asks Rick for any information he has about Tony, and Rick tells him that Tony's parents own a restaurant where he works after school. That night, Bob takes the kids out to dinner. Violet wonders why he's taking them across town to one specific restaurant. Sitting down at the table, they're greeted by their waiter, Tony. Startled, Violet shoots water out of her nose, and Tony offers her napkins to clean herself up. Bob tries to push Violet into chatting with Tony, but she just gets more embarrassed and angry. She pushes herself away from the table and walks out of the restaurant.", "At the station, Chad is talking with Helen through a monitor, and she tells him that she's at a secure, undisclosed location. She's actually on top of the building, on a transmission tower. Chad shows footage from the hovertrain rescue, when the Screenslaver appears on the monitors. Activating her tracker, Helen locates the source of the signal. The Screenslaver rants about how people are controlled by screens because they're lazy. Meanwhile, Elastigirl vaults from one building to another, zeroing in on the source. Finally, she arrives at an apartment building. Snaking her arm under the door, she unlocks it and runs in. The Screenslaver appears behind her and pushes her and himself into a giant cage, then zaps her with a taser. He turns on blinking lights to hypnotize her, but she manages to push him out of the cage and slither out herself. They fight around the room, then he runs out the door, activating a timer on the way out. She runs after him, and he activates a fire alarm, causing others to come running out. He slips down an elevator shaft and onto a rooftop, with Helen in pursuit. Suddenly, he leaps off the roof. Helen jumps after him, grabs him and makes a parachute. As the timer hits zero, the building blows up, and she reaches up and grabs the mask off his face. On the ground, he's led away in handcuffs by the police, acting confused. Helen thanks Evelyn for setting up the tracker.", "Back at the house, Dash asks Bob for help with his new math lesson. Watching TV, Bob sees a story about how a car called the Incredible, a car he once owned when he was a public superhero, had been bought by a billionaire at an auction. Thinking the car had been destroyed along with his house, Bob angrily rummages through some boxes and finds the old remote control for the car. Pressing a button, he makes the car start on the screen. Dash snatches the remote and starts pressing buttons. Everyone in the studio takes cover from the seemingly live car. Bob grabs the remote back and powers it down. Suddenly Jack-Jack sneezes and teleports himself into Violet's room. She runs down the stairs screaming, as Jack-Jack now has turned into a red monster, chasing after her. Jack-Jack turns back into his normal self, and Dash and Violet realize he has powers, and Bob hadn't told them. Violet asks if he told Helen, and he says no. When she asks why, he angrily tells them that he's Mr. Incredible, and he's trying to hold the house together through everything. Taken aback, Violet says that she's going to call Lucius.", "Lucius comes over, and he sees Jack-Jack suddenly turn invisible. Weary, Bob grabs cookies and holds one up to lure Jack-Jack out. He reappears, grabs the cookie and munches on it. Bob tells Lucius that he can't keep giving Jack-Jack cookies, but when he stops, the red monster appears and starts biting Bob's arm. Desperate for some relief, Bob takes Jack-Jack and drives up to Edna's house. Seeing him looking like he hadn't slept in days, she invites him in. He tells her that he needs some alone time, and asks if he can leave Jack-Jack with her. Jack-Jack looks at her face and transforms his own nose to look like hers. Bit by bit, he transforms the rest of his face to match her. Fascinated by his powers, she agrees to take him and quickly shoves Bob out the door. Bob goes back to the house and collapses on the sofa. He apologizes to Violet for having Rick erase Tony's memory, then making things worse at the restaurant. He says he's just trying to be a good dad, and Violet replies that he's not good, he's super. She hugs him, before realizing that he fell asleep sitting up.", "At the Deavors' house, a party was going with video playing of Elastigirl catching the Screenslaver. Winston announces that Supers will be legal again, and he triumphantly holds up the Screenslaver's suit and goggles, saying that Elastigirl is the one who made it all possible. He says they'll sign an agreement on his ship, the Everjust, and it will be televised around the world. Helen rewatches the footage of the Screenslaver capture, and she realizes that something isn't quite right. She slips away to the control room and watches some of the raw footage. Evelyn comes in behind her with drinks, happy to be away from the crowd. She tells Helen that her brother knows how to handle people, but she herself never knows what they want. Helen asks her what she thinks they want, and she replies that people value ease more than anything. Helen tells her that she thinks catching the Screenslaver was too easy, then she notices that one of the Screenslaver's monitors is tuned into her suit camera. Evelyn says that he must have hacked into the closed circuit, but Helen replies that if he was able to do that, he wouldn't just have simple locks on his door. She realizes that he himself must have been hypnotized by the goggles he was wearing, and she grabs the goggles to inspect them. With a swift move, Evelyn forces the goggles onto Helen's head.", "Bob wakes up groggy, and realizes he had been sleeping on the couch. Violet took off his shoes and gave him a blanket and pillow. Later, he goes to Edna's house and thanks her for watching Jack-Jack. She says that she stayed up all night, working on a suit that will control all of his powers. Putting Jack-Jack into the testing chamber, she shows Bob how Jack-Jack's suit can anticipate which of his powers he's about to use. When Jack-Jack turns into a flame, the suit activates an extinguisher with blackberry-flavored fire retardant spraying all over him, and he happily licks it up. Relieved at finally having some control, Bob takes Jack-Jack and puts him in the car.", "As the blinking lights in the goggles go out, Helen wakes from her trance, finding herself strapped to a chair. Trying to move, she lets out a scream of pain. Evelyn comes on the intercom and tells her that the temperature around her is below freezing, and that if she tries to stretch, she'll break. Helen realizes that Evelyn is the real Screenslaver, and the person she locked away was an innocent victim. Helen tells Evelyn that she counted on her, and Evelyn asks her why, because she built her a bike? Evelyn says that they didn't really know each other. Helen asks about her brother, and Evelyn replies that he's weak, depending on the Supers to always save him, just like his father did. Helen asks if she's going to kill her, and Evelyn says that she plans to use her instead.", "Back at the house, the kids see Jack-Jack in his new suit. Bob demonstrates how he can now control the baby, with Jack-Jack using his laser eyes on command. Then Jack-Jack uses his warp power to disappear, and Bob shows them a device to scan for his location. Seeing him in the corner, Dash holds out a cookie, which Jack-Jack reappears to grab and chomp down. The phone rings, and Evelyn tells Bob that Helen is in trouble. She says she doesn't want to say what happened on the phone, and it's best if he meets her at DevTech, where the ship is docked. Bob immediately calls Lucius and tells him to watch the kids, and to bring his super suit, since things might get weird. Suspicious at Bob's sudden leaving, Dash runs and grabs the car's remote control, and Violet gets out the super suits and has them all put the suits on. The doorbell rings, and they open it to see the other supers from the party, all being controlled with a pair of goggles.", "Voyd tells them that they're not safe, and the Deavors sent them for protection. Just then, Frozone runs up and stands between them and the kids, telling them they're not needed. He tries to shut the door, but they block him. Dash presses a button on the remote, activating the Incredible, which blasts out of its garage and flies toward the house. Frozone blasts the Supers with an ice wall and slams the door. Dash grabs Jack-Jack as the Supers force their way in. Dash tries to run outside, but he keeps finding himself still inside the house, thanks to Voyd's portals. As Frozone is fighting Screech, Violet creates a force field around herself and her brothers to shield them from He-lectrix's zapping blasts. As Krushauer tries to crush the force field, the Incredible flies in and stops just before them. Dash and Violet get in and escape, but the other Supers grab Frozone and put a pair of goggles on his head.", "Evelyn takes Bob to see Helen on the ship, and as soon as he walks in, Helen starts punching him in the face. Stunned at first, Bob tries to fight back, but he can't bring himself to attack his wife. As she comes at him with more punches and kicks, he grabs her and tries to break her trance. She kisses him, and with surprise, he kisses back. Then she stretches and grabs a pair of goggles from Evelyn and puts them on his head.", "Evelyn tells Winston that the heroes are on the ship, resting, and he orders the ship to head out. In the Incredible, Dash and Violet take a moment to decide what to do. They realize they have only themselves, the car and Jack-Jack. They get to the DevTech building and see the ship take off. Dash wishes the car could follow the ship, and it drives itself off the dock and into the water. Jetting itself along, the car quickly catches up to the ship. Violet asks how they'll get on the ship, and Dash replies that it would be great if the car had ejector seats. A message flashes across the dashboard, &quot;Ejector seats activated.&quot; Suddenly they find themselves flying through the air toward the ship. Violet surrounds them with a force field, allowing them to land safely on deck. Just then, Winston activates the ship's hydrofoil, causing it to float out of the water. Evelyn has Winston gather the supers in a room for the signing ceremony. Violet sees them go into the room, then comes back to Dash to find that Jack-Jack had gone missing. Using the tracker, they find him going up in an elevator. They go to follow, but are cut off by Voyd, who attacks Violet. She tries to fight back by using force fields, but Voyd keeps opening portals to deflect them. Dash takes off after Jack-Jack, but he realizes Violet isn't behind him, so he runs back and speed-punches Voyd before she can put goggles on Violet.", "The kids find Jack-Jack in a hall and grab him. With the other Supers coming behind, they hide in a vent. Trying to keep Jack-Jack quiet, they give him the tracker to play with. Hearing Jack-Jack coo, Krushauer uses his power to crush the vent. Getting angry, Jack-Jack transforms into a giant baby and bursts out of the vent, knocking out Krushauer and destroying the tracker. Violet uses a cookie to calm Jack-Jack, who grabs it and goes smashing through the walls, heading toward the room where the Supers are gathered. Turning back to his normal size, he teleports through the last wall. Dash and Violet look for another way in. As the signing ceremony goes live, Evelyn takes control of all of the Supers, having them tell the world that they don't serve the people anymore, only themselves. They reach toward the camera, and the feed goes dead.", "Back at the studio, Chad awkwardly tells the audience to stand by as they sort out their technical issues. On the ship, Evelyn watches as Mr. Incredible, Elastigirl and Frozone lock the delegates in the room with the other Supers. They head up to the bridge and quickly disarm a guard, who gets on his radio and exclaims that Supers have taken the ship. Elastigirl turns the steering wheel, guiding the ship on a path toward the city. Mr. Incredible crushes the wheel, rendering the ship unsteerable. Dash and Violet follow Jack-Jack to the bridge, and without hesitation, their parents and Frozone attack them. Violet throws up a force field for protection, and Jack-Jack floats through the air, landing in Elastigirl's arms. With her momentarily confused, Jack-Jack reaches up and rips off her goggles. Evelyn orders Mr. Incredible and Frozone to grab her, but she rips off their goggles.", "The other Supers burst in and attack, and Jack-Jack transforms into a monster. Elastigirl is surprised to see that he has powers. He-lectrix tries to attack Violet, but monster Jack-Jack rips off his goggles. Soon, all the goggles are off and the Supers stop fighting, but the ship is still heading for the city. Evelyn grabs Winston and heads for a jet. Bob tells Helen to go after her, to finish the mission, while they handle the ship. Bob goes for the engine compartment, but is confronted by Krushauer, still wearing a pair of goggles. He tries to crush Bob with the walls, but he quickly jumps out of the way and hurls a piece of debris at Krushauer, knocking off his goggles. Krushauer is free from his trance, but now the room is filled with debris, blocking his entrance to the engine room. Winston is coming out of his camera-induced trance, and he realizes his sister is the Screenslaver. She pulls him into the jet, but he jumps out before she takes off. Running back to the room, he turns off the screen that was keeping everyone hypnotized, and orders them all to the back of the ship. Elastigirl and Voyd go to the deck and see Evelyn taking off. Voyd opens a portal for Elastigirl to use, and she lands on top of the jet. She forces her way in, and Evelyn starts flying wildly, flinging Elastigirl all around the cabin. Elastigirl makes her way to the pilot's chair and is about to punch Evelyn, but she puts an oxygen mask on herself and starts climbing rapidly. With the air getting thinner, Elastigirl starts to feel weak.", "On the ship, Mr. Incredible tells the others that he can't stop the ship, and Dash suggests turning it from the outside. Frozone freezes one of the foils, causing it to break and sending the ship back down to the water. Mr. Incredible lowers the anchor, wrapping himself in the chain. He gets plunged into the water, with Dash waiting for him to turn the rudder. As time passes, Dash gets increasingly worried. But then, the ship starts to turn, and Dash presses the button to lift the anchor.", "On the jet, Evelyn kicks Elastigirl in the face. Spotting a flare gun, Elastigirl fires it at Evelyn's oxygen tank, creating an explosion that sends Evelyn flying out the window. Elastigirl puts the jet on autopilot, swings out the window, grabs Evelyn and makes a parachute. Refusing to be saved by a Super, Evelyn kicks herself free and starts falling again, but Elastigirl grabs her again and Voyd opens a portal over the water, depositing them both safely on the ship's deck.", "With the ship turning away from the city, a large wave gets kicked up. Frozone freezes it to create a cushion for the side of the ship to run into. Helen turns to Bob and asks if she missed Jack-Jack's first power, and he says more like the first seventeen. Evelyn is led into a police car in handcuffs, and she tells Helen that saving her life doesn't make them right, but Helen is unfased at her enemy's remark. Bob tells Violet that she should try introducing herself to Tony again. Days later, a judge rules that Supers should be made legal again. At school, Violet walks up to Tony and introduces herself. They chat for a while, getting to know each other again.", "One night, Tony walks out of his door and into a car where the Parr family is sitting. They all head off to a theater together. When they get there, they see a group of police cars chasing down a criminal. Violet gets Tony out of the car, hands him money for tickets and popcorn, and tells him to save her a seat. Confused, Tony does as ordered. Violet gets back in the car, and they all put on their suits and masks. Bob pushes a button, transforming the car into a family sized Incredi-wagon. Bob hits the gas, and the family sets off on another adventure together."],
			"trailer" : "https://www.imdb.com/videoembed/vi3210917913"
		},
		{
			"name" : "The Boss Baby",
			"year" : "2017",
			"overview" : "A story about how a new baby's arrival impacts a family, told from the point of view of a delightfully unreliable narrator, a wildly imaginative 7 year old named Tim.",
			"img" : "bossbaby.jpg",
			"genre" : ["Animation","Adventure","Comedy","Family","Fantasy"],
			"likes" : 25,
			"runtime" : 97,
			"plot" : "A suit-wearing, briefcase-carrying baby pairs up with his 7-year old brother to stop the dastardly plot of the CEO of Puppy Co.",
			"storyline" : "Seven-year-old Tim Templeton has always had an overactive imagination--and for the past seven years--life has been all peaches for him, getting all the love and affection from his caring parents. However, after the arrival of Boss Baby, an unexpected new brother dressed in a black suit complete with a tie and a briefcase, Tim won't be the centre of attention anymore, as the powerful sibling takes over the whole house, robbing him of all care, little by little. But, soon, Tim and the new Boss in a diaper will need to put differences aside and join forces, as a sneaky scheme involving the head of Puppy Co. threatens to tilt the balance of power towards their insidiously adorable furry antagonists, not to mention that the next Pet Convention is only in two days. Brothers, hurry up. Written by Nick Riganas",
			"director" : "Tom McGrath",
			"writers" : ["Michael McCullers", "Marla Frazee"],
			"stars" : ["Alec Baldwin", "Steve Buscemi", "Jimmy Kimmel"],
			"sites" : [[" DreamWorks Animation [United States]","http://www.dreamworksanimation.com/"],["Official Facebook","https://www.facebook.com/thebossbaby/"]],
			"country" : "USA",
			"language" : "English | Spanish",
			"releaseDate" : "30 March 2017 (Germany)",
			"aka" : "Un jefe en pañales",
			"locations" : ["DreamWorks Animation Studios"],
			"budget" : ["$125,000,000 (estimated)","$50,198,902, 2 April 2017, Wide Release","$175,003,033","$527,965,936"],
			"synopsis" : ["Seven-year-old Tim Templeton (voice of Miles Bakshi) has an active imagination. He has all the love in the world from his parents Ted and Janice (voices of Jimmy Kimmel and Lisa Kudrow), who play with him in all of his adventures. Ted and Janice work at PuppyCo in the marketing department, which Tim thinks is a cool job. As Tim's adult self (voice of Tobey Maguire) narrates, things became different when Tim's parents asked him how he would feel about having a little brother. Young Tim tells them he is enough, unaware that his mother is pregnant.", "Within the foundations of BabyCorp, numerous babies are being born (never quite explained how) and are being processed through a conveyor belt. One small baby in particular goes through the motions, getting a fresh diaper and a pacifier. The tickle machine determines where babies are placed. If they laugh, they are sent to families. If they don't react, they are sent to management. The baby boy is pushed into management and is given his own suit, watch, and briefcase before being assigned to his cubicle.", "Tim anxiously looks out the window to see his parents returning in a taxi with their new baby. It's the same baby from before, The Boss Baby (voice of Alec Baldwin), strutting up to the front door with his briefcase, to Tim's bewilderment. From the moment he enters the house, Boss Baby begins to command the household. Ted and Janice are so busy trying to please Boss Baby that Tim starts to feel shut out. However, Tim seems to be the only one that finds something suspicious about Boss Baby, with his suit and briefcase standing out.", "Tim sneaks into Boss Baby's room that night and hears him speaking with the voice of a grown man on the phone. He appears to be conspiring with someone until Tim catches him and forces Boss Baby to admit that he can talk. Although Tim thinks he's got something on him, Boss Baby is unfazed and pulls out a file on Tim, stating he knows things like how Tim's middle name is Leslie. Boss Baby warns Tim that if he doesn't shape up, his parents can &quot;fire&quot; him.", "Tim sets out to prove that Boss Baby is up to no good. He spies on Boss Baby as he has a playdate with other baby associates - Jimbo (voice of David Soren), Staci (voice of ViviAnn Yee), and the Triplets (voice of Eric Bell, Jr.). Boss Baby gives a presentation about BabyCorp's enemy, PuppyCo. The CEO, Francis Francis (voice of Steve Buscemi), is set to unveil their newest puppy, which could spell trouble for babies everywhere. The other babies start to get anxious when Boss Baby starts to ask what they learned from the presentation. They put on their baby act for the parents when they come around.", "Tim has a tape of the babies' conversation, but the babies catch him and set off to get the tape. This leads to Tim having to evade the babies in the backyard as he tries to show the tape to his parents. Boss Baby rides a small car to get Tim while the other babies go after him. Tim traps Staci in the sandbox while Jimbo rides through a fence, and the Triplets are also stopped. Tim runs back into the house, just as the adults are walking outside to see their kids in a chaotic scene. Tim runs to his parents' office and finds Boss Baby sitting in their chair. He demands the tape or else he will harm Tim's favorite stuffed doll, Lamb-Lamb. They fight for it, and they accidentally rip Lamb-Lamb's head off. Tim gets angry and grabs Boss Baby, putting him in his walker and threatening to launch him out the window. Ted and Janice walk in and see this, causing Tim to launch the tape into the street instead. Since they think he's trying to harm his brother, Tim's parents ground him.", "Boss Baby goes into Tim's room as he is crying. He decides to finally explain his situation to the boy. Boss Baby gives Tim one of his pacifiers and tells him to suck on it until he finds the answers he's looking for. The two are then teleported to BabyCorp as projections, watching how everything works. Boss Baby explains how he got into management and how there have been many other great Boss Babies before him. His own boss, Big Boss Baby (voice of Edie Mirman), runs her department with an iron fist. Boss Baby aspires to be like the most famous baby, Super Colossal Big Fat Boss Baby, so he can get the dream promotion with his own office and personal potty. He also explains how the babies stay babies, which is by drinking a special formula that stops them from aging. When Big Boss Baby is seen demanding results from Boss Baby, he panics and snaps himself and Tim back to reality. He explains that if he doesn't succeed in his mission to bring down PuppyCo, he will get fired and be forced to live with the Templetons forever. Tim then agrees to help Boss Baby, but only so he can leave.", "The boys then try to pretend for their parents that they love each other and are playing together, while also working together to find info on the new puppy. Ted and Janice later invite the boys to &quot;Bring Your Kid To Work Day&quot; at PuppyCo. Once there, Ted and Janice invite Tim to spend time with them while they leave Boss Baby in the puppy pit. Tim thinks about it but decides to stay with Boss Baby so they can look for the new puppy. Tim has Boss Baby dress up as a puppy to get past security. They go into a room and find a file on the new puppy, but they must replace it with another file. It works until Boss Baby gets drool on the replacement, setting off a trap. The puppy file then turns out to be a fake. The boys are caught by Eugene (voice of Conrad Vernon), a man dressed as PuppyCo's mascot.", "Eugene brings the boys to meet Francis. He reveals to them that he is Super Colossal Big Fat Boss Baby, now all grown up. As a baby, he got the promotion he wanted and was at the top of his game. But because he is lactose intolerant, the formula stopped working for him, and he was booted out of BabyCorp. Now, he plots revenge against them by creating the Forever Puppy, which will stay a cute puppy for all time, stealing all the love away from babies. The only thing Francis needs is some formula for the puppy to be created, which Eugene takes out of Tim's backpack. He then sends the boys away.", "Ted and Janice leave the boys with Eugene (disguised as a housekeeper) while they go with Francis to Las Vegas to unveil the Forever Puppy. Without the formula, Boss Baby starts acting like a real baby. Tim and Boss Baby come up with a plan to escape Eugene by faking Boss Baby being sick and spewing fake vomit all over Eugene. The boys then ride away on Tim's bike, while Eugene chases them on a wagon. Boss Baby calls Staci and has her round up Jimbo and the Triplets to help the boys. Together, they get Tim and Boss Baby to the airport while stopping Eugene. Unfortunately, the plane for Vegas takes off before the boys can stop their parents. They then argue with both throwing the blame on one another, with Tim blaming Boss Baby for being a normal baby at the worst moment, while Boss Baby argues that they would have gotten there faster if Tim could ride a bike without training wheels. Tim tells him he knows nothing about having a real family, leading to Boss Baby ditching Tim and leaving him alone at the airport.", "Hours later, Boss Baby calls Tim on a phone right next to him. They reconcile and resolve to work together to get to Vegas themselves since they now know they need each other. The boys follow Elvis impersonators for a convention to Vegas, unaware that Eugene is following them as well.", "On the plane ride to Vegas, Tim pretends that he and Boss Baby are the captain's kids to get special perks. He shows Boss Baby how to have fun by engaging in a playtime scenario where they are pirates hijacking a ship. Boss Baby really gets into it and has actual fun for the first time in his life.", "The boys make it to Vegas and arrive at the convention center for the unveiling. Francis reveals the Forever Puppy to the public with Ted and Janice helping him. When the boys reveal themselves, Francis locks Ted and Janice inside a giant heart and wheels them away. Eugene tries to get the boys as they run after Francis, who is set to literally launch the Forever Puppies with a rocket. Eugene runs through a set of tubes to get to the boys, but they outsmart him and cause him to fall into a giant litter box to get scratched up by cats. The boys catch up to Francis, who tries to throw them over the ledge. Tim and Boss Baby re-enact their pirate game and throw Francis into a vat of formula. They rush to save their parents and get the puppies out of the rocket. Boss Baby then becomes a normal baby and is stuck up on the rocket until Tim sings Paul McCartney's &quot;Blackbird&quot; too get the baby down. Tim then protects his brother as the empty rocket launches.", "Tim runs to the formula vat and gives Boss Baby some of it to bring him back to normal. Francis then emerges from the vat, now reverted back to Super Colossal Big Fat Boss Baby. He threatens the boys until Eugene picks him up and gives him a pacifier. Eugene tells the boys that he will raise Francis the right way this time.", "The boys go home, and Boss Baby is able to leave to get his promotion. The other babies from BabyCorp wipe Ted and Janice's memories of the baby and remove any evidence that he was there, but Tim chooses not to forget him. Boss Baby returns to work as a hero and he gets his promotion like he wanted. However, both boys miss one another and don't feel happy even though they got what they wanted.", "Tim writes a letter to Boss Baby and sends him some of his toys. Boss Baby gets excited and he runs into the main room to play with the computer and basically quit. He goes through the conveyor belt and has himself sent down the &quot;family&quot; chute.", "Sometime later, Boss Baby returns to the family as a normal baby, now named Theodore Lindsay Templeton. Tim is excited to see him, as the baby appears to remember him. He runs up and grabs his new baby brother. The two then go on to have many adventures.", "We jump to the future with Adult Tim having been telling the whole story to his daughter, who is about to meet her own baby sister. With them is Adult Ted, still having a nice brotherly bond with Tim. Tim's daughter looks in the delivery room and sees her baby sister. To her surprise, the baby rises from her bed and is wearing a suit."],
			"trailer" : "https://www.imdb.com/videoembed/vi4249860377"
		},
		{
			"name" : "Jurassic World",
			"year" : "2015",
			"overview" : "Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.",
			"img" : "jurassicworld.jpg",
			"genre" : ["Action","Adventure","Science Fiction"],
			"likes" : 23,
			"runtime" : 124,
			"plot" : "A new theme park, built on the original site of Jurassic Park, creates a genetically modified hybrid dinosaur, which escapes containment and goes on a killing spree.",
			"storyline" : "22 years after the original Jurassic Park failed, the new park (also known as Jurassic World) is open for business. After years of studying genetics the scientists on the park genetically engineer a new breed of dinosaur. When everything goes horribly wrong, will our heroes make it off the island?",
			"director" : "Colin Trevorrow",
			"writers" : ["Rick Jaffa (screenplay by)", "Amanda Silver (screenplay by)"],
			"stars" : ["Chris Pratt","Bryce Dallas Howard", "Ty Simpkins"],
			"sites" : [["Official site", "http://www.jurassicworld.com"]],
			"country" : "USA",
			"language" : "English",
			"releaseDate" : "11 June 2015 (Germany)",
			"aka" : "Jurassic World 3D",
			"locations" : ["Louisiana", "USA"],
			"budget" : ["$150,000,000 (estimated)","$208,806,270, 12 June 2015, Wide Release","$652,270,625","$1,670,400,637"],
			"synopsis" : ["Jurassic World has been running smoothly with fresh entertainment ideas, as well as developing new species of dinosaurs every few years to keep up with the short attention span of their customers. With their well-funded bravado, scientists like the long-lasting Henry Wu, move to create more terrifying and deadly creatures. When a new species, the Indominus Rex, is created everything goes awry.", "Claire Dearing, the organized director of the new and refurbished Jurassic World theme park, seeks out the one hope they have, the bungalow-residing Owen Grady. Two children, Zach and Gray, nephews of Ms Dearing, plan to have a nice visit to the park without their parents. Things break loose into immense danger when they encounter the Indominus Rex on board an attraction, the Gyrosphere. While the tourists take refuge, the Indominous still roams disappointed at the loss of its hopeful meal of two kids and a duo of ex's trailing not far behind searching for the children.", "A man named Hoskins, an employee for the raptor foundation yearns for them one of the agile, smart, killing animals to be converted into bloodthirsty war machines. Trying to take them into his own grasp, he strikes a deal with the once noble Dr Wu and brings in a battalion of his followers to ship them up. Balancing the fate of her sister's kids, the safety and customers of the park, the new breed, and the naive dinosaur seller, Claire and Owen must solve everything before Jurassic Park like its predecessor, dissolves into history."],
			"trailer" : "https://www.imdb.com/videoembed/vi1176612889"
		},
		{
			"name" : "Star Wars: The Last Jedi",
			"year" : "2017",
			"overview" : "Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares to do battle with the First Order.",
			"img" : "lastjedi.jpg",
			"genre" : ["Fantasy","Adventure","Science Fiction","Action"],
			"likes" : 49,
			"runtime" : 152,
			"plot" : "Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares for battle with the First Order.",
			"storyline" : "Jedi Master in hiding Luke Skywalker unwillingly attempts to guide young hopeful Rey in the ways of the force, while Leia, former princess turned general, attempts to lead what is left of the Resistance away from the ruthless tyrannical grip of the First Order. Written by Danny Moniz",
			"director" : "Rian Johnson",
			"writers" : ["Rian Johnson", "George Lucas"],
			"stars" : ["Daisy Ridley", "John Boyega", "Mark Hamill"],
			"sites" : [[" Official Facebook","https://www.facebook.com/StarWars"],["Official Site", "https://www.starwars.com/the-last-jedi/"]],
			"country" : "USA",
			"language" : "English",
			"releaseDate" : "14 December 2017 (Germany)",
			"aka" : "Star Wars - Episode VIII: Die letzten Jedi",
			"locations" : ["Pinewood Studios", "Iver Heath", "Buckinghamshire", "England", "UK"],
			"budget" : ["N/A","$220,009,584, 17 December 2017, Wide Release","$620,181,382","$1,332,539,889"],
			"synopsis" : ["The opening crawl from this latest film 'Star Wars, Episode VIII: The Last Jedi' reads that the First Order is plotting to seize military control of the galaxy. A team of Resistance fighters led by General Leia Organa (Carrie Fisher) are planning an evacuation from their main base as Supreme Leader Snoke's (Andy Serkis) forces are coming for them. The Resistance holds out hope that Luke Skywalker (Mark Hamill) will return to bring hope.", "The opening scene shows Poe Dameron (Oscar Isaac) and the droid BB-8 are flying over the First Order's dreadnought as General Hux (Domhnall Gleeson) orders his men to fire upon Poe and the Resistance's base. Other fighters head in for the attack. Poe orders a fighter, Paige (Veronica Ngo), to drop the payload onto the dreadnought. The fighters take heavy hits, and Paige is knocked away from her remote. With mere moments before the First Order obliterates the Resistance, Paige is able to grab the remote and drop all their bombs down on the dreadnought, completely destroying it at the cost of her life. The rest of the fighters go into hyperspace to escape.", "Aboard the First Order ship, a hologram of Snoke reprimands Hux for failing to stop the evacuation. Kylo Ren (Adam Driver) enters the meeting. Snoke notes that, in spite of Kylo killing his father, Han Solo, he may still turn to the light side of the Force. Although Kylo protests, Snoke doesn't have faith in him. On his way down the elevator, Kylo smashes his helmet to pieces in rage.", "Meanwhile, former storm trooper Finn (John Boyega) wakes up from his coma after his light-saber battle with Kylo. Poe finds him and is happy to see him. The first thing Finn asks is for Rey (Daisy Ridley).", "Rey has just arrived on the planet Ahch-To with Chewbacca (Joonas Suotamo) and R2-D2 (Jimmy Vee) on the Millenium Falcon to find Luke. She hands him his light-saber, but he just callously tosses it over his shoulder. Confused, Rey follows Luke, but he doesn't want to see her or know who she is and why she has sought him out. She tells him that Leia sent her to find him. Chewie breaks down the door to Luke's hut. Luke then asks Chewie where Han is.", "Leia demotes Poe as a result of his actions with the dreadnought. Moments later, the First Order ship catches up to the Resistance after tracking their hyper-speed. The First Order deploys their TIE fighters to attack. Kylo flies in in his own TIE fighter and prepares to launch the killing strike against the Resistance leaders, but he pulls back after sensing Leia on board. The other TIE fighters fire upon them, causing a blast that sucks the rebel leaders into space to their deaths. Leia pulls herself back to the ship using the Force, but she goes unconscious.", "Rey and Kylo begin to feel a connection in which they can see and communicate with each other. With Luke still not wanting to have anything to do with the Force or the Jedi, R2 plays him Leia's original message to Obi-Wan Kenobi to persuade Luke to help (from the first Star Wars film 'A New Hope'). Luke senses Rey's power and eventually agrees to give her lessons in the way of the Jedi and why it must end.", "With Leia out of commission, Vice Admiral Holdo (Laura Dern) assumes command of the Resistance. Meanwhile, Finn attempts to hop on an escape pod. He is found by mechanic Rose Tico (Kelly Marie Tran), who is mourning Paige, her sister. Rose is a big fan of Finn, seeing him as a Resistance hero. However, she zaps him with her taser when she realizes he's trying to escape. Finn notes that the First Order is tracking them through hyper-speed, and they can't make another jump because they are dangerously low on fuel, and the First Order will find them anyway. With Poe's help, they contact Maz Kanata (Lupita Nyong'o) for assistance, but she is in the middle of a fierce battle. She does tell them that she knows a code-breaker on Canto Bight that can help them, and they need to find him wearing a particular symbol.", "Rey's first lesson sees Luke attempting to show her to feel the Force and control it. Rey is able to see visions and manipulate small pebbles as she achieves balance. However, she soon sees a vision of herself being pulled toward a dark pit, with Luke trying to break her out of it. The pit spews water and snaps Rey out of the vision. Luke says she saw the dark side of the Force, and she didn't even try to stop herself. He tells her he has seen something like this once before, and it didn't scare him then as it does now. This is why he considers the ways of the Jedi to be a failure.", "Finn, Rose, and BB-8 arrive at a casino on Canto Bight. Finn is impressed with the glitz and wealth of the casino, but Rose hates the place because only the weapons dealers who sell to the Empire are rich enough to gamble there. It is also home to a number of rotten people who take pleasure in misdeeds, including cruelty to giant but gentle creatures called fathiers that are forced to race, and enslaved children who live with them in the stables as caretakers. The trio finds the Master Codebreaker (Justin Theroux) playing at a table, but the heroes get captured and thrown into a jail cell for illegally parking their ship. In their cell, Finn and Rose meet a stuttering scoundrel named DJ (Benicio Del Toro). He overhears the two of them needing a code-breaker, and he offers his services. DJ manages to open their cell and helps them escape, and they climb down to the stable. Rose, fascinated by the beautiful fathiers, stops to free one from its stable and finds a small boy inside. Frightened, he nearly pushes a panic button but Rose shows him her ring with the Resistance's symbol. They fight guards on the way out with the help of BB-8 and ride the fathiers as they stampede through the casino to get away. Finn and Rose's ship is destroyed but BB-8 and DJ bring them another one to make their escape.", "Luke mentions that the last time he saw Kylo Ren as his student, he had attempted to kill him by collapsing his hut on him. As Rey and Kylo continue to connect, Kylo tells Rey that Luke saw the power growing in Kylo and had attempted to get rid of him before he got stronger.", "Holdo starts to set in motion plans to evacuate the Resistance ship to a nearby Resistance stronghold, the planet Crait. Poe believes she is doing something wrong, and he attempts to stage a mutiny. Before his plans can go into effect, Leia appears after waking up and she incapacitates Poe. Leia allows Holdo's plan to go ahead.", "Rey confronts Luke over what Kylo told him. They engage in a brief fight before she asks if he really tried to kill Kylo. Luke explains that he sensed nothing but great darkness in Kylo, with no hope of him turning back. He did consider killing him but backed out of it, only for Kylo to see him with the light-saber and respond with a counterattack. Rey decides to leave Ahch-To with Chewie and R2. Luke walks by the tree containing sacred Jedi texts when he is met by a familiar face...YODA (voice of Frank Oz). He destroys the tree with a lightning bolt, to Luke's dismay. Yoda's spirit tells Luke to help Rey before she is also lost to the dark side. Luke considers himself a failure, but, in the words of Yoda, &quot;The greatest teacher, failure is.&quot;", "Meanwhile, Finn, Rose, and DJ make it to the First Order's ship. Unfortunately, they are captured by Captain Phasma (Gwendolyn Christie) and her goons, with DJ having told the villains Finn and Rose's plan in order to gain monetary compensation. At the same time, Rey arrives on the same ship and is taken prisoner by Kylo Ren.", "Kylo brings Rey to Snoke. Rey tries to get Kylo to abandon the dark side, but Snoke taunts Rey as she tries to fight back. Snoke reveals that he created the connection between her and Kylo in an attempt to destroy Luke. Snoke attempts to get Kylo to kill Rey with his light-saber, but Kylo uses Luke's light-saber to impale Snoke and cut him in half. Rey and Kylo then fight Snoke's soldiers and slaughter them all. Kylo, now fully taken over by the dark side, tries to get Rey to join him, but she refuses and tries to get him on the Resistance side. Kylo attempts to manipulate Rey when mentioning her parents. Despite her trying to forget, her parents were just junk traders who sold her off. Rey eventually resists and leaves to rejoin the Resistance while Kylo assumes his role as the new Supreme Leader.", "As the Resistance fighters are making their way to Crait, Hux's men start to fire upon the transports, killing heavy numbers of the Resistance. Seeing no other option, Holdo sacrifices herself and rams the command ship at light-speed into the First Order ship, splitting it in two and destroying other nearby ships.", "BB-8, having escaped the villains' clutches, commandeers a AT-AT armored Walker to fire upon the First Order soldiers. Finn and Rose prepare to escape, but Finn battles Phasma until he overpowers her. She tells him he was always scum, to which he proudly responds, &quot;Rebel scum.&quot; The ship starts to come apart, and Phasma falls into the burning wreckage. Finn and Rose head off to meet the others on Crait.", "The surviving Resistance fighters have dwindled to a few dozen or so. Kylo and Hux lead gigantic walkers to the Resistance stronghold, armed with a battering ram cannon that will obliterate the entrance. Poe leads Finn, Rose, and a few others on speeders to fight back. Rey and Chewie come down with the Falcon to draw away TIE fighters while Finn attempts to stop the cannon. He nearly flies head on until Rose crashes her ship into his to stop him. Finn goes to her and asks why she did it. She tells him they always fight for what they love. She kisses him and then passes out. Finn rushes back to the stronghold to get Rose medical attention.", "The First Order fires their cannon onto the stronghold. Poe and Leia appear hopeless with most of their comrades dead and their own doom approaching. Suddenly, Leia is visited by Luke. The two siblings have a final meeting, with Luke saying that &quot;Nobody is ever truly gone.&quot; Luke goes out to face the First Order. Kylo orders the soldiers to fire everything on Luke where he stands. Even after the insane amount of firepower unleashed on Luke, he still stands and coolly brushes his shoulder off. Poe realizes Luke is distracting the villains to allow them to escape. The fighters follow crystal wolves to an exit, only to be blocked by a huge pile of rocks.", "Kylo goes down to face Luke himself. They duel with their light-sabers, and Kylo attempts to strike Luke with a killing blow, only to realize Luke is a hologram... projecting himself while still on Ahch-To. Luke tells Kylo that he will not be the last Jedi. At that moment, Rey uses the Force to clear the way for the fighters. She and Finn embrace. Kylo screams in rage at his defeat as the heroes board the Falcon and escape.", "On Ahch-To, Luke finishes using what power he had left. He looks up and sees a twin sunset, just like back on Tatooine. He smiles, and then, he vanishes, now completely becoming one with the Force. Rey tells Leia that she has sensed that Luke is now gone, and she asks what will become of the Resistance now. Leia tells her they have what they need to rebuild.", "On Canto Bight, a trio of stable children that previously encountered Finn and Rose are telling each other the story of Luke Skywalker. Their master comes over to scold them to force them back to work. The boy they had found in the stable goes outside to sweep. He looks up at the sky to see the Falcon flying overhead, and, with Rose's Resistance ring on his finger, he raises his broom like a light-saber.", "The film closes with the words, &quot;In loving memory of our princess, Carrie Fisher.&quot;"],
			"trailer" : "https://www.imdb.com/videoembed/vi2993666329"
		},
		{
			"name" : "Hotel Transylvania",
			"year" : "2012",
			"overview" : "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday.",
			"img" : "hoteltransilvania.jpg",
			"genre" : ["Animation","Comedy","Family","Fantasy"],
			"likes" : 37,
			"runtime" : 91,
			"plot" : "Dracula, who operates a high-end resort away from the human world, goes into overprotective mode when a boy discovers the resort and falls for the count's teenaged daughter.",
			"storyline" : "In 1895, Dracula builds a resort in Transylvania, hidden from the humans, to raise his beloved daughter Mavis in a safe environment. In the present, the place is the Hotel Transylvania, where monsters bring their families to vacation far from the frightening humans. Dracula invites his friends - Frankenstein and his wife Eunice; Wayne and Wanda, the werewolves; Griffin, the invisible man; Murray, the mummy; Bigfoot, among others - to celebrate the 118th birthday of Mavis. When the party is ready to start, the 21-year-old Jonathan is walking through the forest and stumbles upon the hotel. Dracula sees Jonathan and disguises him as a monster to hide Jonathan from the guests. But Mavis also sees Jonathan and Dracula forces him to pose as a monster. Soon Mavis believes that Jonathan is the &quot;zing&quot; of her life despite the advice of her father about humans. Written by Claudio Carvalho, Rio de Janeiro, Brazil",
			"director" : "Genndy Tartakovsky",
			"writers" : ["Peter Baynham (screenplay by)", "Robert Smigel (screenplay by)"],
			"stars" : ["Adam Sandler", "Kevin James", "Andy Samberg"],
			"sites" : [["Official Facebook","https://www.facebook.com/HotelT"]],
			"country" : "USA",
			"language" : "English",
			"releaseDate" : "25 October 2012 (Germany)",
			"aka" : "Hotel Transsilvanien",
			"locations" : ["N/A"],
			"budget" : ["$85,000,000 (estimated)","$42,522,194, 30 September 2012, Wide Release","$148,313,048","$358,375,603"],
			"synopsis" : ["Dracula (voiced by Adam Sandler) is the owner and creator of Hotel Transylvania, a five-star resort where the world's monsters can be safe from human civilization. Dracula invites some of the most famous monsters like Frankenstein (Kevin James) and his wife Eunice (Fran Drescher), Murray the Mummy (Cee Lo Green), Wayne and Wanda Werewolf (Steve Buscemi and Molly Shannon), Griffin the Invisible Man (David Spade), Bigfoot, Steve the Blob, and other monsters to celebrate the 118th birthday of his daughter Mavis (voiced by Selena Gomez). However, Mavis prefers to explore the outside world with her father's permission, but the village he directs her to is actually an elaborate deception to convince her of the threat of humans enough to coax her back.", "However, this charade inadvertently attracts the attention of an ordinary young traveler named Jonathan (voiced by Andy Samberg) who was exploring the surrounding forest and followed the staff to the hotel. Once Jonathan enters the hotel, Dracula frantically attempts to hide him from the patrons such as disguising him as a Flesh Golem named Johnny-stein with the later hasty cover story of being a relative of one of Frank's body parts. Eventually, Jonathan is discovered by Mavis and company, forcing Dracula to claim he is going to arrange Mavis' birthday party with a young perspective. In doing so, Jonathan manages to charm everyone at the hotel, especially Mavis. Eventually, even Dracula begins to like the human taking him into his confidence about his family's traumatic past after the vampire notices the young man knows something about them in a respectful manner.", "Unfortunately, Chef Quasimodo Wilson (Jon Lovitz) realizes Jonathan is human and captures him to cook him, forcing Dracula to directly intervene by magically freezing the chef. Eventually, the birthday party happens and it is a raucous success until Dracula freaks out when Mavis and Jonathan have an innocent kiss. A ranting Dracula accidentally lets it slip that he tricked Mavis at the fake village and Mavis is outraged at being manipulated by her own father. Things get worse when a still-frozen Chef Quasimodo interrupts the party as the Fly (Chris Parnell) translates his frozen language to the clientele which states that Jonathan is actually a human. Even as the clientele are revolted, Mavis still accepts and expresses her desire to be with Jonathan even though he is human. For his part, Jonathan feels obliged to reject Mavis for her father's sake and leaves the hotel. Afterward, Dracula realizes that in his efforts to protect Mavis, he has broken her heart and now she tearfully wants to stay at the hotel forever.", "Wishing to undo his mistake, Dracula persuades his friends to help him find Jonathan and even risks his destruction by venturing out in the daylight to do so. Learning that Jonathan is about to board a flight out of Transylvania Airport shortly, they race on and enter a town en route. At that town, Dracula and company are stunned to see the humans having a 'Monster Festival'. To clear a path, Frankenstein tries to scare them, but finds the humans are cheerfully welcoming them instead and even provide a shaded route through the town for Dracula to proceed at maximum speed.", "However, Dracula finds that he is too late with Jonathan's plane taking off. With no alternative, Dracula desperately flies after it in broad daylight despite being hurt by the sun. With much effort, Dracula manages to reach the plane and resorts to mind-controlling one of the pilots (Brian Stack) to apologize and tell Jonathan that he wants him to return to be with his daughter. Jonathan accepts Dracula's apology and Dracula manipulates the plane back to the airport.", "Later, Dracula returns Jonathan to Mavis, who tells her that she's his 'zing' and the reason why he had to reject her. Dracula gives his blessing to their relationship, Jonathan and Mavis kiss and the hotel has another party to celebrate his daughter's liberating coming of age before Jonathan and Mavis set off on their travels.", "The film ends with Dracula and his friends being shown in traditional animation (in the style of Genndy Tartakovsky's cartoons) during the credits."],
			"trailer" : "https://www.imdb.com/videoembed/vi2571739673"
		},
		{
			"name" : "Antboy",
			"year" : "2013",
			"overview" : "12-year-old Pelle accidentally gets bitten by an ant and develops unimaginable superpowers. With help from his friend, comic book nerd Wilhelm, Pelle creates a secret identity as the superhero Antboy.",
			"img" : "antboy.jpg",
			"genre" : ["Comedy","Adventure","Family"],
			"likes" : 21,
			"runtime" : 77,
			"plot" : "12-year-old Pelle is bitten by an ant and develops superpowers. Aided by comic book nerd Wilhelm, Pelle creates a secret identity as superhero Antboy. When a super villain The Flea enters the scene, Antboy must step up to the challenge.",
			"storyline" : "12-year-old Pelle is bitten by an ant and develops superpowers. Aided by comic book nerd Wilhelm, Pelle creates a secret identity as superhero Antboy. When a super villain The Flea enters the scene, Antboy must step up to the challenge.",
			"director" : "Ask Hasselbalch",
			"writers" : ["Anders Ølholm (screenplay)", "Kenneth Bøgh Andersen (based on: the Antboy books by)"],
			"stars" : ["Oscar Dietz", "Amalie Kruse Jensen", "Samuel Ting Graf"],
			"sites" : [["Official Facebook [Denmark]","https://www.facebook.com/AntboyFilmen/"],["Official site [Denmark]","http://www.antboy-filmen.dk/"]],
			"country" : "Denmark",
			"language" : "Danish",
			"releaseDate" : "27 March 2014 (Germany)",
			"aka" : "Antboy - Der Biss der Ameise",
			"locations" : ["Valby", "Copenhagen", "Denmark"],
			"budget" : ["N/A","N/A","N/A","N/A"],
			"synopsis" : ["It looks like we don't have a Synopsis for this title yet."],
			"trailer" : "https://www.imdb.com/videoembed/vi279358745"
		},
		{
			"name" : "Minions",
			"year" : "2015",
			"overview" : "Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
			"img" : "minions.jpg",
			"genre" : ["Family","Animation","Adventure","Comedy","Action"],
			"likes" : 43,
			"runtime" : 91,
			"plot" : "Minions Stuart, Kevin, and Bob are recruited by Scarlet Overkill, a supervillain who, alongside her inventor husband Herb, hatches a plot to take over the world.",
			"storyline" : "Ever since the dawn of time, the Minions have lived to serve the most despicable of masters. From the T-Rex to Napoleon, the easily distracted tribe has helped the biggest and the baddest of villains. Now, join protective leader Kevin, teenage rebel Stuart, and lovable little Bob on a global road trip. They'll earn a shot to work for a new boss, the world's first female supervillain, and try to save all of Minionkind from annihilation. Written by Universal Pictures",
			"director" : "Kyle Balda, Pierre Coffin",
			"writers" : ["Brian Lynch"],
			"stars" : ["Sandra Bullock", "Jon Hamm", "Michael Keaton"],
			"sites" : [["Official Blog","http://minionnation.tumblr.com/"],["Official Facebook","https://www.facebook.com/minions/"]],
			"country" : "USA",
			"language" : "English | Spanish",
			"releaseDate" : "2 July 2015 (Germany)",
			"aka" : "Minions",
			"locations" : ["N/A"],
			"budget" : ["$74,000,000 (estimated)","$115,200,000, 12 July 2015, Wide Release","$336,045,770","$1,163,534,901"],
			"synopsis" : ["The movie starts with a narration about the minions, how they have existed since long ago, seeking the most evil entity to serve. The change from master to master is due to the fact that they often cause their masters' demise. One day they find themselves isolated in an ice cavern and thrive as a tribe. But as time passes they lose spirit in living because they don't have a master. A minion Kevin decides to go to the outside world to find a master. He gets Stuart and Bob as his companions. They arrive in New York and after some time wandering around they find a secret villain TV channel that announces the Villain Con in Orlando. Hitching a ride with the Nelsons, who turn out to be villains also, the minions reach Villain Con. There they see Scarlet Overkill, then the worlds most notorious villain, who turns out to be seeking henchmen. Bob accidentally wins the contest to become Scarlet's henchman.", "The minions follow Scarlet to her castle and Kevin phones his fellow minions to come. She tasks the minions to steal the royal crown from Queen Elizabeth of Britain. With gadgets from Scarlet's husband Herb, the minions succeed in stealing the crown but get caught red handed so they run from capture, until Bob accidentally releases the sword in the stone from the Excalibur legends. Thus Bob is crowned king. Scarlet is infuriated by this and visits the minions. They happily give the crown and the kingship to Scarlet. But Scarlet instead sends them to a torture chamber. But somehow the minions are immune to the torture equipment and they sneak back into Scarlet's coronation ceremony to apologize. But again theiy bodge it, as instead they crash an ancient chandelier onto Scarlet's head. Scarlet sends the other villains from Villain Con after the minions. Stuart and Bob get captured.", "Kevin escapes and stumbles onto Herb's secret weapon, which transforms him into a gigantic minion. He saves Stuart and Bob while battling Scarlet, while the rest of the minions arrive. Kevin swallows Scarlet's rocket but prevents her escape, blowing her up and returning Kevin to his size. Kevin, Stuart and Bob are rewarded by the Queen. But Scarlet is still alive and returns to steal the crown, only to be stopped by young Gru, who takes the crown and gains the minions as his servants."],
			"trailer" : "https://www.imdb.com/videoembed/vi996454425"
		},
		{
			"name" : "Despicable Me",
			"year" : "2010",
			"overview" : "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
			"img" : "despicableme.jpg",
			"genre" : ["Animation","Family","Comedy","Fantasy"],
			"likes" : 37,
			"runtime" : 95,
			"plot" : "When a criminal mastermind uses a trio of orphan girls as pawns for a grand scheme, he finds their love is profoundly changing him for the better.",
			"storyline" : "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this home is a vast secret hideout. Surrounded by a small army of minions, we discover Gru, planning the biggest heist in the history of the world. He is going to steal the moon. (Yes, the moon!) Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes. Written by Universal Pictures",
			"director" : "Pierre Coffin, Chris Renaud",
			"writers" : ["Cinco Paul (screenplay by)", "Ken Daurio (screenplay by)"],
			"stars" : ["Steve Carell", "Jason Segel", "Russell Brand"],
			"sites" : [["Official Facebook","https://www.facebook.com/DespicableMe"],[" Official site","http://www.universalpicturesinternational.com/"]],
			"country" : "USA | France",
			"language" : "English",
			"releaseDate" : "30 September 2010 (Germany)",
			"aka" : "Ich - Einfach unverbesserlich",
			"locations" : ["N/A"],
			"budget" : ["$69,000,000 (estimated)","$56,397,125, 11 July 2010, Wide Release","$251,513,985, 20 January 2011","$543,113,985, 20 January 2011"],
			"synopsis" : ["The film begins with the news revealing that an Egyptian pyramid was stolen. When super-villain Gru (Steve Carell) hears of this, his pride is wounded and he plans to pull the biggest heist of the century by stealing the Moon.", "Gru tries to get a loan from the Bank of Evil (Formerly Lehman Brothers) and meets a young super-villain, Vector (Jason Segel), who annoys him. Bank president Mr. Perkins (Will Arnett) refuses to grant Gru the loan until he obtains the shrink ray necessary for the plan. Mr. Perkins tells Gru that he is getting too old and that new super-villains are younger and better, like Vector, who is revealed to be the one who stole the Pyramid of Giza.", "Gru and his minions steal the shrink ray from a top secret research facility in East Asia, but Vector steals it from him and shrinks his ship. Gru attempts to get the shrink ray back from Vector's lair, but all his attempts to enter the lair prove futile. After seeing three orphaned girls, Margo (Miranda Cosgrove), Edith (Dana Gaier), and Agnes (Elsie Fisher) enter the lair to sell cookies to Vector. Gru adopts the girls from Miss Hattie (Kristen Wiig), the head of the orphanage, to use them to steal back the shrink ray. Gru has his assistant Dr. Nefario (Russell Brand) build robots disguised as cookies. He then has the girls sell the robots to Vector, and the robots help Gru steal the shrink ray.", "On the way home the girls ask to go to an amusement park. Gru agrees, intending to leave the girls there. Instead, the attendant says he, as an adult, has to ride the roller coaster with them. Gru ends up having fun with the girls. Back at home, he presents his plan to Mr. Perkins via video. The girls keep interrupting him. Perkins again refuses to give him the loan, claiming that although he doesn't have a problem with the plan, he just wants a younger villain to do it instead. Gru has a flashback of his childhood, depicting his wanting to go to the moon after seeing the first moon landing. When he tried to impress his mother (Julie Andrews) with models of the rocket (and an actual working one), she just ignored him. Mr. Perkins calls Vector (revealed to be his son, whose real name is Victor) to the Bank of Evil to inform him that Gru has the shrink ray. Vector reassures his father that he will get the Moon. Gru almost abandons his plan due to lack of funds, but the girls and the minions take up a collection to keep it going.", "However, Gru has to make a choice, because the moon will be in the optimal position for the heist on the same day as the girls' ballet recital. Dr. Nefario, seeing the girls as a distraction, contacts Miss Hattie, who arrives to take the girls back. Gru, the Minions, and the girls are heartbroken. Gru goes on with his plan and flies to the moon.", "Gru successfully shrinks and pockets the Moon. Gru remembers the ballet recital and rushes to it. However, it has ended by the time he arrived. There, he finds a ransom note from Vector demanding the moon in exchange for the girls. After Gru hands over the moon, Vector reneges on the deal, keeping the girls and the moon. This enrages Gru, who storms Vector's lair, this time successfully breaching the defenses. Vector flies off in an escape pod with the girls. Gru holds on to the exterior of the ship. He nearly falls to his death, but is rescued by Dr. Nefario piloting the same ship that Vector shrunk before. Nefario reveals that the bigger the object, the quicker the effects of the shrink ray wear off. Very soon, the moon begins to grow and roll around inside Vector's ship, hurting him and freeing the girls. The girls see Gru outside of the ship, and Gru tells them to jump over to him. Edith and Agnes successfully make it onto the ship, but before Margo can jump, Vector grabs her. The moon rolls again and knocks Vector over, and Margo grabs onto Gru's grappling hook. Gru rescues her with the help of his minions, while the rapidly-expanding Moon wrecks Vector's controls, causing his ship to carry it back into orbit.", "Gru and the girls settle down to live a happy life as a family and Vector is stranded on the Moon. The girls give a special ballet recital for Gru, his minions, and his mother, who finally tells him she is proud of him and acknowledges him to be the better parent. The music changes from Swan Lake to You Should Be Dancing, and everyone rushes on stage to dance as the film ends."],
			"trailer" : "https://www.imdb.com/videoembed/vi1581384729"
		},
		{
			"name" : "Werner - Beinhart!",
			"year" : "1990",
			"overview" : "Comic artist Brösel trades a magic pen that helps him come up with funny stories for the promise to fulfill one of Rumpelstiltskin's wishes. The resulting animated films show episodes of the life of Werner.",
			"img" : "werner.jpg",
			"genre" : ["Action","Animation","Comedy"],
			"likes" : 55,
			"runtime" : 93,
			"plot" : "Broesel has to make a Werner animation film but right now he has no real ideas for new stories. Thus he simply draws some stories from Werner's youth.",
			"storyline" : "Broesel has to make a Werner animation film but right now he has no real ideas for new stories. Thus he simply draws some stories from Werner's youth. Written by Volker Boehm",
			"director" : "Gerhard Hahn, Niki List",
			"writers" : ["Rötger Feldmann (comic) (as Brösel)", "Ernst Kahl"],
			"stars" : ["Klaus Büchner", "Andi Feldmann", "Kulle Westphal"],
			"sites" : [["N/A","#"]],
			"country" : "Germany",
			"language" : "German",
			"releaseDate" : "29 November 1990 (Germany)",
			"aka" : "Twardziel Werner",
			"locations" : ["N/A"],
			"budget" : ["N/A","N/A","N/A","N/A"],
			"synopsis" : ["It looks like we don't have a Synopsis for this title yet."],
			"trailer" : "https://www.youtube.com/embed/xe5wRjjX3gQ"
		},
		{
			"name" : "The Fifth Element",
			"year" : "1997",
			"overview" : "In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.",
			"img" : "5element.jpg",
			"genre" : ["Adventure","Fantasy","Action","Science Fiction"],
			"likes" : 37,
			"runtime" : 126,
			"plot" : "In the colorful future, a cab driver unwittingly becomes the central figure in the search for a legendary cosmic weapon to keep Evil and Mr. Zorg at bay.",
			"storyline" : "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando Major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones. Written by Claudio Carvalho, Rio de Janeiro, Brazil",
			"director" : "Luc Besson",
			"writers" : ["Luc Besson (screenplay by)", "Robert Mark Kamen (screenplay by)"],
			"stars" : ["Bruce Willis", "Milla Jovovich", "Gary Oldman"],
			"sites" : [["N/A","#"]],
			"country" : "France",
			"language" : "English | Swedish | German | Arabic | Egyptian (Ancient)",
			"releaseDate" : "28 August 1997 (Germany)",
			"aka" : "Das fünfte Element",
			"locations" : ["UK"],
			"budget" : ["$93,000,000 (estimated)","$17,031,345, 11 May 1997, Wide Release","$63,540,020, 5 October 1997","$263,920,180, 10 July 2012"],
			"synopsis" : ["The story's premise is that every five thousand years, in conjunction with a planetary arrangement, a 'Great Evil' appears whose purpose is to destroy life. In preparation for the next appearance in 2263, a group of aliens called the Mondoshawan arrive on Earth in 1914 to extract the only weapon capable of defeating the Great Evil, a collection of four stones representing the Classical Elements and the eponymous Fifth Element that conjugates the other four into organic life. After taking the weapons, the Mondoshawans present a key to a priest and tell him to pass the information provoking their mission through future generations in preparation for the Evil's arrival.", "In 2263, the Great Evil appears and in the form of a fiery planet and destroys an fleet of interplanetary battleships. On Earth, the world's president consults with his military and science advisers about the approaching planetoid, which when provoked, grows larger. When the Mondoshawans attempt to deliver the Elements back to Earth, they are ambushed by another alien race, the shape-shifting Mangalores. Earthly scientists are able to recover a portion of the Fifth Element and use a reconstitution device to recreate it, whereupon it takes the form of an apparently human woman named &quot;Leeloo&quot; described as &quot;the perfect being&quot;. Leeloo, terrified of her unfamiliar environs, escapes the scientists and arrives in the care of taxi driver Korben Dallas, a former major in the Federated Army's Special Forces. Dallas then delivers her to Priest Vito Cornelius, the current guardian of the Mondoshawans' knowledge. Dallas, Cornelius, and his acolyte David help Leeloo recover, though Dallas is forced out of Cornelius' apartment before learning her purpose. Cornelius learns from Leeloo that the four Elements were not carried by the Mondoshawans but instead entrusted to Diva Plavalaguna, a singer currently performing on a luxury space liner at Fhloston Paradise, and that Leeloo must recover the stones from her. Meanwhile, wealthy industrialist Jean-Baptiste Emmanuel Zorg has attempted to gain the stones as urged by communication with the Great Evil. After learning that the Mangalores' attack on the Mondoshawans was unsuccessful in recovering the stones, Zorg betrays and kills them, whereupon the surviving Mangalores decide to extract revenge and gain the stones for themselves.", "Dallas is later met at his apartment by his General Munro, who informs him that he has been drafted back into the Army in order to travel to meet the Diva, having rigged the annual Gemini Croquette Contest to allow Dallas to win. Their meeting is interrupted by the arrival of Cornelius and Leeloo. Dallas, learning of Leeloo's need, offers to help, but is knocked out by Cornelius, who steals his winning transportation tickets and departs with Leeloo. Dallas accepts the job from General Munro and travels to John F. Kennedy International Airport, intercepting Cornelius, David, and Leeloo before they board their flight, and escorts Leeloo. The Mangalores and Zorg's assistant are rebuffed by the ticketing agent when they try to pose as Dallas. Cornelius instructs David to prepare the temple in Egypt and then sneaks aboard the passenger spaceplane before it leaves.", "On the flight, Dallas meets interstellar radio personality Ruby Rhod, who escorts him as the contest winner. Upon arrival at Fhloston Paradise, Dallas is taken by Ruby to prepare for the show, while Leeloo waits near the Diva's quarters in order to retrieve the stones from her after her performance. The Diva's show is interrupted by the Mangalores, and the Diva is fatally shot. Dallas learns from her dying words that the Diva has hidden the stones inside her body; after she dies, Dallas extracts them, giving them to Ruby to hold as he defeats the Mangalores and saves the rest of the passengers and crew. Leeloo is able to defeat the Mangalores that attempt to ransack the Diva's quarters. Zorg, having flown himself to Fhloston, fights Leeloo at the Diva's quarters, injuring her and forcing her to retreat. He takes the case he believes contains the stones while starting a time bomb. When Dallas goes to recover Leeloo, Zorg finds the case to be empty. Zorg re-enters the liner just as Dallas, Leeloo, Cornelius, and Ruby leave it on Zorg's ship. Zorg is able to stop his bomb; but the defeated Mangalores activate another bomb, destroying Zorg and the liner.", "The four return to the temple on Earth as the Great Evil rushes towards the planet. There, Dallas finds Leeloo disillusioned and unwilling to perform her role, believing that humans will destroy themselves despite her rescue of them. As the protagonists arrange the stones in the temple to form their weapon, they are briefly baffled by their ignorance of the weapon's operation, but discover that each stone is triggered by the presence of the Classical element to which it corresponds. Dallas then convinces Leeloo to perform her role, embraces her, and kisses her. At this, Leeloo releases the weapon's &quot;Divine Light&quot;, causing the Great Evil to become a new moon in Earth's orbit. Later, the President and General Munro go to the reconstitution lab to congratulate Dallas on his successful mission, but he and Leeloo are unavailable, despite the president's assertion that he is in a hurry. Viewers then see he and Leeloo are making love in the resurrection chamber."],
			"trailer" : "https://www.imdb.com/videoembed/vi854720793"
		},
		{
			"name" : "Star Trek ",
			"year" : "2009",
			"overview" : "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion.The human adventure has begun again.",
			"img" : "startrek.jpg",
			"genre" : ["Science Fiction","Action","Adventure"],
			"likes" : 51,
			"runtime" : 127,
			"plot" : "The brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful Romulan from the future creates black holes to destroy the Federation one planet at a time.",
			"storyline" : "On the day of James Kirk's birth, his father dies on his damaged starship in a last stand against a Romulan mining vessel looking for Ambassador Spock, who in this time, has grown on Vulcan disdained by his neighbors for his half-human heritage. 25 years later, James T. Kirk has grown into a young rebellious troublemaker. Challenged by Captain Christopher Pike to realize his potential in Starfleet, he comes to annoy academy instructors like Commander Spock. Suddenly, there is an emergency on Vulcan and the newly-commissioned USS Enterprise is crewed with promising cadets like Nyota Uhura, Hikaru Sulu, Pavel Chekov and even Kirk himself, thanks to Leonard McCoy's medical trickery. Together, this crew will have an adventure in the final frontier where the old legend is altered forever as a new version of the legend begins. Written by Paramount Pictures",
			"director" : "J.J. Abrams",
			"writers" : ["Roberto Orci", "Alex Kurtzman"],
			"stars" : ["Chris Pine", "Zachary Quinto", "Simon Pegg"],
			"sites" : [["Official Facebook","https://www.facebook.com/StarTrekMovie"],["Official site","http://www.startrekmovie.com/"]],
			"country" : "USA | Germany",
			"language" : "English",
			"releaseDate" : "7 May 2009 (Germany)",
			"aka" : "Star Trek",
			"locations" : ["Alaska", "USA"],
			"budget" : ["$150,000,000 (estimated)","$72,500,000, 8 May 2009","$257,730,019, 7 October 2016","$385,680,446, 7 October 2016"],
			"synopsis" : ["In the year 2233 a Federation starship, USS Kelvin, investigates a &quot;lightning storm&quot; in space, which the crew soon realizes is a black hole. A massive vessel, the Narada, emerges, creating an alternate timeline. The Narada, possessing advanced weaponry, opens fire on the Kelvin, inflicting heavy damage. The Narada's Romulan first officer, Ayel (Clifton Collins Jr.), hails the outmatched Kelvin and demands that its captain, Richard Robau (Faran Tahir), come aboard the Narada via shuttlecraft. Captain Robau agrees and hands command of the ship to his first officer, George Kirk (Chris Hemsworth). Robau orders Kirk to wait fifteen minutes for his signal and evacuate the ship if he doesn't make contact.", "Robau is taken to the Narada while the crew of the Kelvin monitors him. Ayel interrogates him first about a particular ship, which Robau does not recognize, and then about the whereabouts of Ambassador Spock, with whom Robau is also unfamiliar. The Narada's captain, Nero (Eric Bana), sits in the background, saying nothing. Upon citing the stardate, Robau is impaled with a teral'n, a pronged bladed weapon, by Nero, and the display of his vital signs on the bridge of the Kelvin instantly flatlines; Robau is dead. Kirk orders the Kelvin to open fire. As the situation worsens and he realizes that the damage to the Kelvin is compromising the lives and safety of everyone aboard, he orders the crew to escape pods and shuttles, including his wife Winona (Jennifer Morrison), who is about to give birth.", "Kirk tries to plot a collision course with the Narada, but autopilot navigation is offline; he will need to control the Kelvin himself. He orders his wife to leave on the shuttle without him. She protests, but Kirk knows that he has no choice but to stay behind and continue the attack in order to protect the others who are leaving on escape pods. On the shuttlecraft, Winona Kirk gives birth to a baby boy. As the Kelvin destroys the missiles aimed at the shuttles, Kirk can hear his newborn's cries but realizes that he will never meet his son. Just before the Kelvin collides with the Romulan vessel, Kirk asks Winona what they should name their son. She suggests naming him after George's father, but he laughs the suggestion off and says that &quot;Tiberius&quot; isn't much of a first name. They decide to name him &quot;Jim,&quot; after Winona's father. Communication is cut off as the Kelvin smashes into the Narada, crippling it briefly and giving the shuttles time to escape.", "Approximately ten years later on Earth, in Iowa, a young boy (Jimmy Bennett) recklessly drives his dead father's antique Corvette (which, from the novelization, his stepfather is selling while the boy's mother is off planet). The stepfather (Greg Grunberg) calls the young boy on a built-in phone to warn him against getting even one scratch on the car. The boy ignores the warning and drives down the road blasting 20th century music (the Beastie Boys' song &quot;Sabotage&quot;), passing his older brother Johnny while honking the horn to get his attention. A policeman (Jeremy Fitzgerald) on a flying motorcycle tells the boy to pull over, but he instead turns onto a road leading to a stone quarry. He destroys the car in the deep pit, jumping out moments before it slides over the edge. When the policeman asks the boy his name, the boy defiantly says &quot;My name is James Tiberius Kirk.&quot;", "Meanwhile, on the planet Vulcan, a young Spock (Jacob Kogan) is being tormented by bullies (Lorenzo James Henrie, Colby Paul, and Cody Klop) who tease him about his mixed heritage, calling his Vulcan father a traitor for marrying his human mother. The three have previously failed to evoke an emotional response in Spock by stirring his human side (exactly 34 times previously, according to Spock himself), but this time they take it too far, calling his mother a &quot;human whore.&quot; Their plan backfires, and Spock knocks one of the older boys into a learning pod and beats him in an emotional rage. He is later admonished by his father, Sarek (Ben Cross), who is disappointed at his son's lack of emotional control and tells him that he has a path to choose and that only he can make the decision.", "Several years later, Spock (Zachary Quinto) is conflicted about whether he should participate in the kolinahr, the Vulcan ritual aimed at purging all emotions. He talks to his mother, Amanda Grayson (Winona Ryder), and she says that she will always be proud of him, no matter what he decides. Later, Spock stands before the Vulcan high council. The chairman (Akiva Goldsman) comments on Spock's perfect record in his attempt to gain entry to the Vulcan Science Academy, saying that his only flaw is that he also applied to Starfleet Academy. Spock explains it was logical to explore all options, which the others agree was logical but unnecessary. They accept him into the Vulcan Science Academy despite his &quot;disadvantage&quot; of being half human. Upon hearing their decision, Spock declines the appointment and states that he will enter Starfleet Academy instead. Commenting on the fact that he is the first Vulcan to reject an appointment to the Vulcan Science Academy, he sardonically tells the committee that their record is still perfect since he is, in fact, part human.", "Meanwhile, in a bar in Iowa, a young Nyota Uhura (Zoe Saldana) meets up with some friends. As they order drinks, James Kirk (Chris Pine), somewhat inebriated, introduces himself to her and offers to buy her a drink. He unsuccessfully tries to learn her first name and flirts with her, even though she is plainly not interested. Kirk reveals he is intelligent, but another Starfleet recruit (Jason Matthew Smith) has concerns for Uhura. He and three other recruits start a fight with Kirk and beat him up before a senior officer, Captain Christopher Pike (Bruce Greenwood), enters the bar and ends the altercation. Pike sits down with Kirk and tells him that his own dissertation was on the USS Kelvin, Kirk's father's ship. Pike attempts to talk some sense into the rebellious young man and to persuade him to join Starfleet, firmly believing that he can do more with himself than be &quot;the only genius-level repeat offender in the Midwest.&quot; Kirk does not want to hear it and laughs at the idea of joining Starfleet. However, Pike reminds him that his father saved 800 lives in just 12 minutes of command, and challenges Kirk to do better. Pike also predicts that Kirk could attain the rank of captain and have his own ship in only four years.", "Early the next day, Kirk heads to Riverside Shipyard, where the USS Enterprise is being built, and thinks about what Capt. Pike told him. He makes the decision to join Starfleet. Pike is surprised to see Kirk turn up to join the new recruits. Giving his motorbike away to the first person who compliments it, Kirk passes Pike, saying, &quot;Four years? I'll do it in three.&quot; He boards the recruit shuttle, surprising Uhura and the recruits whom he fought with the night before. Another man, Leonard McCoy (Karl Urban), also boards the shuttlecraft, arguing furiously with a cadet who repeatedly commands him to sit. Taking a seat next to Kirk, the somewhat nervous doctor starts ranting about what could physically happen to them should anything go wrong with the shuttle's systems. Kirk is amused and tries to remind him that Starfleet works in space. McCoy explains that he has nowhere else to go; having lost everything he had in a divorce, the only things he has left are his &quot;bones.&quot; The two become instant friends.", "Three years later, the Narada is waiting in an remote part of space. Nero, who has lost part of his right ear and has bites wounds on his head since his arrival in the past, is called to the bridge by Ayel. Suddenly, a temporal disturbance (another black hole similar to the one the Narada appeared from in the past) appears and a small starship, the Jellyfish, flies out. Nero recognizes the ship, welcomes the appearance of Ambassador Spock, and orders the ship to be captured.", "Meanwhile, at Starfleet Academy, Kirk is telling McCoy that he is taking the Kobayashi Maru test again the next day, and is certain he will pass it this time. McCoy is shocked -- nobody passes it, and nobody even repeats it, much less takes it a third time, as Kirk is about to do. Kirk then leaves to &quot;study,&quot; which actually involves sexual foreplay with an Orion cadet named Gaila (Rachel Nichols) in her dorm room. Suddenly, Gaila's roommate enters, and Kirk hides under the bed. Her roommate is Uhura, who talks about a message she decoded about a giant spaceship destroying dozens of Klingon warships in Klingon space. Uhura then hears someone under the bed and outs him. Angry that her roommate brought yet another guy to their room, and even angrier that it's Kirk, she kicks him out.", "The next day, Kirk, McCoy, Uhura and a few other Starfleet recruits are in the simulator room, undergoing the Kobayashi Maru test on Kirk's third attempt. Kirk takes a comically casual approach to the test, much to everyone's bewilderment. Everything goes as planned when, unexpectedly, the power systems momentarily fail, the attacking Klingon ships' shields go down, and they are promptly destroyed. From the viewpoint above the simulator room, a technician asks an officer how Kirk was able to beat this test. The officer turns, revealing himself to be Spock.", "During an official inquiry, the Starfleet Academy brass informs Kirk that they have received evidence that Kirk entered a subroutine into the computer making it possible for him to win in the simulation, and accuse him of cheating. Kirk faces his accuser, Spock, and tries to defend himself, stating that &quot;no-win&quot; scenarios are a ludicrous training tool. Spock counters that it's a test of character, not of tactical ability. The hearing is suddenly interrupted when the committee is informed that the Federation has received a distress call from Vulcan. With the primary fleet occupied in the Laurentian system, Starfleet is forced to commission the Academy cadets and dispatch ships immediately to begin a rescue mission.", "Cadets are assigned to ships based on their aptitude, with the most capable cadets assigned to the USS Enterprise, a ship completed so recently that it hasn't even been christened yet. Uhura is initially assigned to the USS Farragut, but complains directly to Spock, citing her numerous commendations and recommendations (many from Spock himself) and insisting she has earned an assignment to the USS Enterprise. Spock replies that he wanted to &quot;avoid the appearance of favoritism,&quot; but ultimately relents and re-assigns Uhura to the Enterprise. Kirk has been grounded pending a ruling on his inquiry, and is not allowed to board the shuttles and join the mission. However, McCoy takes him to the medical bay and injects him with a vaccine, making him temporarily ill. Consequently, he is allowed to take Kirk up to the Enterprise on medical grounds.", "The Enterprise leaves for Vulcan, but not before helmsman Hikaru Sulu (John Cho), standing in for Ensign McKenna, who is ill, disengages the external inertial dampener, which had been preventing them from going to warp. Pavel Chekov (Anton Yelchin) uses the comm system to inform the crew about their first mission. There is a massive lightning storm above Vulcan's upper atmosphere, followed by strange planet-wide seismic disturbances. Their orders are to investigate the seismic disturbance, and aid in evacuation of the planet if necessary. After hearing the announcement, Kirk suddenly recognizes the &quot;lightning storm&quot; detected near Vulcan as exactly the same occurrence the Kelvin encountered two decades earlier. Realizing that they are running straight into a Romulan trap, Kirk rushes through the ship to Uhura, despite suffering a bad reaction to the vaccine McCoy gave him: big, swollen hands and a numb tongue. He asks her about the Klingon distress call she deciphered earlier, and she confirms that the attackers were Romulan.", "The recovered Kirk then rushes to the bridge to inform Captain Pike. Pike is at first skeptical, but after hearing about the distress call Uhura picked up, Spock concludes that Kirk's logic is correct. Uhura is stationed at the communications console on the bridge as, unlike assigned communications officer Hawkins, she can distinguish Romulan from Vulcan. As they disengage warp drive, the Enterprise finds itself in a debris field -- it's the remains of the seven Starfleet ships which arrived shortly before they did and were immediately destroyed by the Narada. With Pike's direction, Sulu is able to navigate through the debris with minimal damage. The Narada attacks the Enterprise, which takes heavy damage on the first volley of torpedoes, destroying the sickbay and reducing shields to 32%. Just as they are about to fire again, Nero recognizes the Enterprise and orders a halt to the attack.", "He hails the Enterprise and identifies himself. Pike, seeing a Romulan, accuses him of an act of war, but Nero says he is a renegade from the Romulan Star Empire. He pointedly greets a confused Spock and orders Pike to come aboard via shuttlecraft, just as he ordered Robau to do years before. Pike asks if there are any hand-to-hand combat-trained officers on the bridge. Sulu volunteers. Pike gathers Sulu, Spock and Kirk and heads for the shuttle bay.", "Pike promotes Spock to captain and puts him in charge of the Enterprise. He also commissions Kirk, naming him first officer, much to Spock's chagrin. Pike outlines his plan to do two things at once: from the shuttle en route to the Narada he will drop Kirk, Sulu and chief engineer Olsen (Greg Ellis) into an orbital skydive. They will land on Narada's drill platform, which is deployed into the Vulcan atmosphere and is drilling a massive shaft to the core of Vulcan, causing the seismic disturbances that prompted the original distress signal. The drilling beam's signal also blocks any communication with the planet, as well as transporter beams. They will disable the drilling beam and then contact Starfleet to inform them of the incident. If all else fails, they are to fall back to the primary fleet at the Laurentian system. If Pike doesn't come back, they will also need to rescue him.", "Spock returns to the bridge and checks in on sickbay. He is surprised to hear Dr. McCoy instead of Dr. Puri, the chief medical officer, who was killed in the attack. Spock formally names McCoy chief medical officer, a job McCoy had already assumed as he works in the sickbay, heavily damaged and inundated with casualties.", "Pike arrives on the Narada after Sulu, Kirk, and Olsen begin their descent. Sulu opens his parachute first, followed by Kirk. An over-enthusiastic Olsen, wearing a red space suit, waits too long to activate his parachute, falls under the drill, and is instantly incinerated by the beam. Kirk lands hard on the platform and proceeds to fight the first Romulan who attacks him. He reaches for his phaser pistol, but the Romulan quickly knocks it out of his hand, forcing Kirk to use his helmet as a weapon. As Sulu approaches the platform, a second Romulan with a disruptor rifle emerges, and Kirk grapples with him. The resulting disruptor fire shoots holes in Sulu's chute, and he too nearly falls victim to the drill's beam. He uses the parachute's repacking mechanism to pull himself onto the platform, then uses his retractable sword to cut it off to avoid being pulled onto a flame vent and incinerated. Sulu engages one Romulan in blade combat while the other goes hand-to-hand against Kirk, who is knocked over and left hanging on the edge of the drillhead. Sulu knocks his adversary onto a vent, killing him. He then stabs the other one with his sword and pulls Kirk to safety. Olsen had the explosives they were going to use to destroy the platform, so they take the Romulans' disruptor rifles and fire on the drill, disabling it.", "Ayel reports the drill's incapacitation, but tells Nero that the shaft had reached Vulcan's core. Nero orders the release of a tiny amount of &quot;red matter&quot; and the return of the drill. Chekov discovers what the red matter is doing: creating a black hole in the middle of the planet. Vulcan will be destroyed in a matter of minutes. Just as Kirk and Sulu are to be beamed off, the drill shifts and Sulu falls. Kirk jumps after him. Catching up, Kirk activates his parachute but, unable to support the weight of two people, it snaps off. The Enterprise can't get a transporter lock on moving targets, so Chekov races to the transporter room and mathematically works out how to do it. The two officers are rescued just before they hit solid rock and arrive on the Enterprise's transporter pad.", "Right after Kirk and Sulu are beamed aboard, Spock beams down to save the Vulcan Council, which includes his parents, Sarek and Amanda, in the kantric arc inside a mountain and unreachable by beaming. As they run outside, several of the elders in the Council are killed by falling rocks and statues, but Spock gets five of them outside, including his parents. As the transporter is about to pick them up, the rock ledge his mother is standing on collapses, causing the transporter to miss her. Spock stands on the Enterprise transporter pad in shock, having lost his mother.", "The Enterprise crew watch in horror as Vulcan implodes into oblivion. Spock records his log entry, stating that over six billion Vulcans perished, and only around 10,000 remain. He notes he is now &quot;a member of an endangered species.&quot; Pike, still a prisoner of the Romulans, is officially listed as the hostage of a war criminal. Nero demands Pike turn over the security codes to defense systems around Earth, but Pike refuses to give them to him, disgusted by Nero's act of genocide on Vulcan. Nero speaks about how the Narada, in his time, was a mining ship, and he was laboring to support his wife, who was expecting his child until she died in the destruction of Romulus. Nero placed blame on the Federation for doing nothing to save his planet, and accused Spock of betraying them, promising himself retribution. Pike pleads that Romulus still exists, but Nero only knows that his world, the Romulus of the future, was destroyed, and he intends to destroy every world of the Federation so that others will know his pain. Forcing a Centaurian slug down Pike's throat to coerce Pike to reveal the security codes, Nero orders the Narada to continue to Earth.", "Spock, in command of the Enterprise, leads the bridge crew in trying to understand what happened. They have determined that the Narada is heading for Earth. Based on their red matter black hole technology, Spock reasons that the Narada must have traveled back in time from the future. He asserts that the Enterprise must regroup with the fleet, but Kirk says that in order to stop Nero they must go after him first. Kirk believes that any delayed action will result in Earth being destroyed. An argument ensues which ends in Spock ordering Kirk's removal from the bridge, but Kirk fights off his security escort. Spock ends it by delivering the Vulcan nerve pinch to Kirk and ordering him placed in an escape pod. The pod is launched and Kirk awakens to find himself on a snow-covered world known as Delta Vega, another planet in Vulcan's system. Picking up his gear, Kirk heads for the Starfleet station 14 kilometers away. He is chased down by a polarilla, which in turn is attacked by an even larger insectoid animal. It chases Kirk into a cave, and when it finally attaches a tendril to catch him, it is spooked off by an elderly man wielding a lit torch. The man reveals himself to be Spock (Leonard Nimoy), Kirk's old friend, but the latter is skeptical.", "Spock mind-melds with Kirk to make Kirk understand why he is there. He explains that 129 years in the future, in the year 2387, the impending supernova of the star Hobus threatened to destroy the home worlds of the Romulan Star Empire and throw off the political balance of the galaxy. Spock developed a stockpile of red matter, a substance that can be ignited to form a singularity -- a black hole capable of absorbing the matter of a supernova. However, while he was en route, the star exploded much earlier than he'd predicted and Romulus was destroyed. Spock launched the red matter from his ship, the Jellyfish, to prevent further destruction to the galaxy. Immediately, Spock was confronted by a surviving Romulan mining vessel, the Narada, captained by Nero. Spock tried to escape, but fed by the mass of the supernova, the resultant black hole captured both the Jellyfish and the Narada, creating a disturbance in the space-time continuum which sent both ships into the past. The Narada exited over 150 years in the past, where it confronted the Kelvin. Spock's ship entered moments later, but what appeared as moments to him was 25 years for the Narada. Nero captured Spock's ship when it finally appeared but kept Spock alive, marooning him on Delta Vega so that he could witness the destruction of Vulcan, just as Nero had to witness the destruction of Romulus. Kirk explains he was left on the planet by the Spock he knows, who is in command of the Enterprise. The elder Spock is surprised, knowing that Kirk should be in command of the ship. It is then that Spock realizes that when Nero exited the wormhole and confronted the Kelvin, he altered history and created an alternate reality.", "Kirk asks Spock whether his father survived in the original timeline. Spock confirms that George Kirk saw his son take command of the Enterprise. Spock leads Kirk to the Starfleet base where they meet this timeline's Montgomery Scott (Simon Pegg): an engineering genius who was also exiled to Delta Vega along with his alien assistant, Keenser (Deep Roy), after beaming Admiral Archer's beagle to an unknown location during a transporter experiment. Spock informs Kirk that he must relieve the Vulcan's younger self of command by provoking him and showing everyone that Spock is too personally and emotionally compromised as a result of Vulcan's destruction and the loss of his mother to lead the mission and command the ship (Starfleet regulation 619). Giving Scotty the mathematical formula for transwarp beaming, an operation originally devised by the older Scott, Spock sends Kirk and Scotty to the Enterprise. After rescuing Scotty from the Enterprise's coolant system, the two are spotted and almost immediately captured by security personnel, led by the guy who got into a bar fight with Kirk three years previously.", "They are taken to the bridge where an astounded Spock demands to know how the two were able to transport to the Enterprise while it was in warp. Kirk refuses to answer and recommends that Scotty do the same. He asks why Spock doesn't feel any anger or have any emotion over the destruction of his planet and the death of his mother, who was murdered. Kirk keeps pushing and provoking Spock until he finally snaps and starts beating Kirk, strangling him to the point of nearly killing him, before he is stopped by Sarek. Realizing how far he has gone, Spock relieves himself of duty and leaves the bridge. Kirk assumes command.", "Following his outburst, Spock returns to the transporter room, where Sarek talks to him. Spock feels a rage he cannot control over the death of his mother. Sarek says that his mother would have said not to bother controlling it, and admits that he married Amanda because he loved her. Meanwhile, on the bridge, Chekov devises a plan to get the Enterprise close to the Narada without the Romulans detecting them: they can follow the Narada and stop at Saturn's system, remaining undetected in the shelter of magnetic field field of the moon Titan. Spock returns and endorses the logic of Chekov's plan. He offers to beam over to the Narada to get the black hole device and save Earth, the only home he has left. Kirk says he will go as well, to rescue Pike.", "The Romulan ship deploys its drilling rig directly over San Francisco and begins to bore into the planet near the Golden Gate Bridge. Warping into Titan's atmosphere, the Enterprise indeed remains undetected, and Kirk and Spock beam over to the Romulan ship -- Scotty thought he would be beaming them to a remote and empty part of the ship, but it turns out to be an occupied portion. After a brief firefight, Spock uncovers the location of the black hole device and Captain Pike by melding with an unconscious Romulan. When they board the Jellyfish, it recognizes Spock as its captain. The Vulcan finally figures out what's going on when the ship's computer confirms its stardate origin as 2387. As Spock uses the Jellyfish to blast his way out of the Narada, Kirk runs into more trouble when he finds the Romulans' bridge, where Nero and Ayel are waiting. Spock destroys the drilling rig before it can reach Earth's core, then goes to warp, and Nero orders pursuit. When Ayel holds Kirk by his throat over a deep drop, he grabs Ayel's pistol and kills him. He heads off to rescue Pike.", "The ships drop out of warp and the Jellyfish turns to intercept and collide with the Narada. Nero orders all weapons to be fired, even though the ship still has red matter aboard; with his plan for revenge ruined, now he only wants to kill Spock. The Enterprise arrives on the scene and destroys the missiles, allowing Spock to carry through with his plan to collide with the Narada. Inside the Narada, Kirk finds Pike, alive but injured due to his earlier torture. Scotty beams Kirk, Pike and Spock from their different locations right before the Jellyfish collides with the interior hull of the Narada and explodes.", "The explosion of the Jellyfish ignites the entire stockpile of red matter on board, creating another black hole. Kirk offers to rescue the Narada but Nero refuses, defiantly stating he'd rather watch Romulus die a thousand times than accept his help. Kirk orders the Enterprise to open fire, blowing the ship apart with phasers and photon torpedoes. The Narada is finally destroyed, but the gravitational pull of the black hole begins tugging on the Enterprise, keeping it from escaping, even with its engines running at warp speed. In a last-ditch effort, Scotty ejects the warp core and detonates it near the black hole. The resulting explosion pushes the Enterprise to safety, and the black hole implodes.", "On Earth, Kirk is commended and given command of the Enterprise. He relieves Pike, who has been promoted to Admiral and is now in a wheelchair. The elder Spock meets with his younger self and tells him that he helped Kirk directly so the two would form a friendship. The older Spock raises his hand in the familiar live-long-and-prosper gesture, but notes that the unusual circumstances do not lend themselves to the famous greeting of the original series, so he simply wishes his younger self &quot;Good luck.&quot; As the elder Spock leaves to help the remaining Vulcans establish a colony, the younger Spock returns to the Enterprise and asks Kirk if he can serve as his first officer, to which Captain Kirk agrees and the Enterprise warps away."],
			"trailer" : "https://www.imdb.com/videoembed/vi1761608473"
		}
	]
}